window.SCHEDULE = {
  "downloads": {
    "bachelor": {
      "fulltime": "../Осень 2026-27 расписание/1-ochnoe.xls",
      "mixed": "../Осень 2026-27 расписание/2-ochno-zaochnoe.xls",
      "distance": "../Осень 2026-27 расписание/3-zaochnoe.xls"
    },
    "master": {
      "fulltime": "../Осень 2026-27 расписание/4-ochnoe-mag.xls",
      "mixed": "../Осень 2026-27 расписание/5-ochno-zaochnoe-mag.xls",
      "distance": "../Осень 2026-27 расписание/6-zaochnoe-mag.xls"
    }
  },
  "groups": [
    {
      "name": "ГП-26з",
      "course": 1,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Вакансия",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Вакансия",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория государства и права",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория государства и права",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-222",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория государства и права",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Логика",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-406",
            "note": "14.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Логика",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-406",
            "note": "14.10.2026; пары нет",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Логика",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-406",
            "note": "14.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История государства и права России",
            "kind": "лекция",
            "teacher": "Кутателадзе З.К.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История государства и права зарубежных стран",
            "kind": "лекция",
            "teacher": "Кутателадзе З.К.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История государства и права России",
            "kind": "практика",
            "teacher": "Кутателадзе З.К.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История государства и права зарубежных стран",
            "kind": "практика",
            "teacher": "Кутателадзе З.К.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационное право",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационное право",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Конституционное право",
            "kind": "лекция",
            "teacher": "Шматов К.А.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Конституционное право",
            "kind": "практика",
            "teacher": "Шматов К.А.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правоохранительные органы",
            "kind": "лекция",
            "teacher": "Маргаритова Р.С.",
            "note": "17.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоохранительные органы",
            "kind": "практика",
            "teacher": "Маргаритова Р.С.",
            "note": "17.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "АП-25з",
      "course": 2,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "room": "М-406",
            "weeks": [
              5
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-406",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы электроники",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы электроники",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование, ч.1",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование, ч.1",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "note": "14.10.2026; пары нет",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерное моделирование,ч.1",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В",
            "note": "14.10.2026; пары нет",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-25з",
      "course": 2,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленная электроника",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-309",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Промышленная электроника",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-309",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Попкова А.А.",
            "room": "М-309",
            "weeks": [
              5,
              6
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ]
      }
    },
    {
      "name": "АП-24з",
      "course": 3,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "лекция",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Антонченко В.П.",
            "weeks": [
              8,
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизация управления жизненным циклом продукции",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Спецглавы теории управления",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Спецглавы теории управления",
            "kind": "практика",
            "teacher": "Самарин Г.Н.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизация управления жизненным циклом продукции",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Спецглавы теории управления",
            "kind": "практика",
            "teacher": "Самарин Г.Н.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника и электроника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехника и электроника",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "АП-23з",
      "course": 4,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория автоматического управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "weeks": [
              14
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы микропроцессорной техники",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы микропроцессорной техники",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технические измерения и приборы",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы микропроцессорной техники",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Программирование контроллеров",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Программирование контроллеров",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Программирование контроллеров",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Механотроника",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Механотроника",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Механотроника",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-23з",
      "course": 4,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электроэнергетические системы и сети",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электроснабжение",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электроснабжение",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехнологии",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехнологии",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ]
      }
    },
    {
      "name": "АП-22з",
      "course": 5,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "CASE-средства при проектировании систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-211",
            "weeks": [
              7,
              9,
              11
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "CASE-средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-211",
            "weeks": [
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "CASE-средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-211",
            "weeks": [
              7,
              9,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Интегрированные системы проектирования и управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-210",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Интегрированные системы проектирования и управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-210",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "ЭП-22з",
      "course": 5,
      "level": "bachelor",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические и электронные аппараты",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "room": "М-404",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические и электронные аппараты",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "room": "М-404",
            "weeks": [
              7
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              7,
              8,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "weeks": [
              7,
              8,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электробезопасность",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "room": "ЭИОС",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электробезопасность",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "room": "ЭИОС",
            "weeks": [
              7
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              8,
              10,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-26з",
      "course": 1,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "лекция",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика, лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-210",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "СМ-25з",
      "course": 2,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-213",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-213",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-213",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-213",
            "weeks": [
              7
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория механизмов и машин",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "room": "У-203",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Философия",
            "kind": "лекция",
            "teacher": "Демченко О.Н.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория механизмов и машин",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "У-203",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Философия",
            "kind": "практика",
            "teacher": "Демченко О.Н.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "room": "ЭИОС",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "ЭИОС",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "ЭИОС",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технологии конструкционных материалов",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологии конструкционных материалов",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологии конструкционных материалов",
            "kind": "лабораторная",
            "teacher": "Леонтьев В.В.",
            "room": "М-303",
            "weeks": [
              10,
              11,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-24з",
      "course": 3,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Осипенко А.А.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Осипенко А.А.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "лекция",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-409",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-409",
            "weeks": [
              5,
              6
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы технологии машиностроения",
            "kind": "лекция",
            "teacher": "Чаава М.М.",
            "room": "https://teams.live.com/meet/9319072616248?p=SiIWaYQLGgLc1ItU8q",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы технологии машиностроения",
            "kind": "практика",
            "teacher": "Чаава М.М.",
            "room": "https://teams.live.com/meet/9319072616248?p=SiIWaYQLGgLc1ItU8q",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин",
            "kind": "лекция",
            "teacher": "Антонченко В.П.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин",
            "kind": "лабораторная",
            "teacher": "Антонченко В.П.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Механика жидкости и газа",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Механика жидкости и газа",
            "kind": "лабораторная",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин",
            "kind": "лабораторная",
            "teacher": "Антонченко В.П.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Механика жидкости и газа",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "weeks": [
              5,
              7,
              9,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "weeks": [
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "weeks": [
              5,
              7,
              9,
              11
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "weeks": [
              13
            ]
          }
        ]
      }
    },
    {
      "name": "СМ-24з",
      "course": 3,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/14590577328591",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/14590577328591",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/14590577328591",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "лекция",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-409",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-304",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-409",
            "weeks": [
              5,
              6
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин и основы конструирования",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин и основы конструирования",
            "kind": "лабораторная",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин и основы конструирования",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин и основы конструирования",
            "kind": "лабораторная",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              16
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Машины непрерывного транспорта",
            "kind": "лекция",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Машины непрерывного транспорта",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "room": "М-101",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "М-101",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "М-101",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Осипенко А.А",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Осипенко А.А",
            "weeks": [
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Осипенко А.А",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ГИ-23з",
      "course": 4,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехника",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "weeks": [
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аэрология горных предприятий",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аэрология горных предприятий",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геомеханика",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерское дело",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерское дело",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркшейдерское дело",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "weeks": [
              9
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              11
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-23з",
      "course": 4,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические подъемно-транспортные машины и оборудование",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "room": "М-312",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические подъемно-транспортные машины и оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "room": "М-312",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические машины и оборудование",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические машины и оборудование",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              9,
              11,
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Защита интеллектуальной собственности",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Защита интеллектуальной собственности",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Триботехника",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Триботехника",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "СМ-23з",
      "course": 4,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Двигатели внутреннего сгорания, автомобили и тракторы",
            "kind": "лекция",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Двигатели внутреннего сгорания, автомобили и тракторы",
            "kind": "лабораторная",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Двигатели внутреннего сгорания, автомобили и тракторы",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Двигатели внутреннего сгорания, автомобили и тракторы",
            "kind": "лабораторная",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "weeks": [
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Машины для земляных работ",
            "kind": "лекция",
            "teacher": "Пыталев И.А.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Машины для земляных работ",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы автоматизированного проектирования ПТС и ДМ",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              8,
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы автоматизированного проектирования ПТС и ДМ",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы автоматизированного проектирования ПТС и ДМ",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              8,
              9,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Грузоподъемные машины",
            "kind": "лекция",
            "teacher": "Курочкин А.И.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Грузоподъемные машины",
            "kind": "практика",
            "teacher": "Курочкин А.И.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-22з",
      "course": 5,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геомеханика",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аэрология горных предприятий",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аэрология горных предприятий",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аэрология горных предприятий",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-22з",
      "course": 5,
      "level": "bachelor",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Системы пыле-газоочистки в металлургии",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "room": "М-205",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Системы пыле-газоочистки в металлургии",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "room": "М-205",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Системы пыле-газоочистки в металлургии",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "room": "М-205",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы автоматизированного конструирования металлургических машин",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "room": "М-305",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы автоматизированного конструирования металлургических машин",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "room": "М-305",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы автоматизированного конструирования металлургических машин",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "room": "М-305",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрический привод металлургических машин",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрический привод металлургических машин",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрический привод металлургических машин",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "лекция",
            "teacher": "Андреева В.Н.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "практика",
            "teacher": "Андреева В.Н.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "практика",
            "teacher": "Андреева В.Н.",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Надежность, эксплуатация и ремонт металлургических машин",
            "kind": "лекция",
            "teacher": "Антонченко В.Л.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Надежность, эксплуатация и ремонт металлургических машин",
            "kind": "практика",
            "teacher": "Антонченко В.Л.",
            "room": "М-303",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Надежность, эксплуатация и ремонт металлургических машин",
            "kind": "практика",
            "teacher": "Антонченко В.Л.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Ф-в: Повышение эффективности эксплуатации металлургических машин и оборудования",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Ф-в: Повышение эффективности эксплуатации металлургических машин и оборудования",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Ф-в: Повышение эффективности эксплуатации металлургических машин и оборудования",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "АП-26",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-406",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Громов В.А.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-210",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Громов В.А.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Громов В.А.",
            "room": "М-307",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "room": "М-210",
            "week": "odd"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "room": "М-210",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-101",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Компьютерное моделирование, часть1",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Компьютерное моделирование, часть 1",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ГП-26",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-301",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-301",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Конституционное право",
            "kind": "лекция",
            "teacher": "Шматов К.А.",
            "room": "М-401",
            "note": "с 18.30",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Конституционное право",
            "kind": "практика",
            "teacher": "Шматов К.А.",
            "room": "М-401",
            "note": "с 18.30",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информационное право",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационное право",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоохранительные органы",
            "kind": "практика",
            "teacher": "Маргаритова Р.С.",
            "room": "М-207",
            "note": "14.10.2026; пары нет; с 18.30",
            "week": "odd"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоохранительные органы",
            "kind": "лекция",
            "teacher": "Маргаритова Р.С.",
            "room": "М-207",
            "note": "07.10.2026; пары нет; С 18.30",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Логика",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Логика",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Риторика для юристов",
            "kind": "лекция",
            "teacher": "Кульбенок Е.А.",
            "room": "М-401",
            "note": "09.10.2026; пары нет",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория государства и права",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Риторика для юристов",
            "kind": "практика",
            "teacher": "Кульбенок Е.А.",
            "room": "М-101",
            "note": "09.10.2026; пары нет",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория государства и права",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория государства и права",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История государства и права России",
            "kind": "лекция",
            "teacher": "Кутателадзе З.К.",
            "room": "М-207",
            "note": "17.10.2026; пары нет",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История государства и права зарубежных стран",
            "kind": "лекция",
            "teacher": "Кутателадзе З.К.",
            "room": "М-207",
            "note": "10.10.2026; пары нет",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История государства и права России",
            "kind": "практика",
            "teacher": "Кутателадзе З.К.",
            "room": "М-207",
            "note": "17.10.2026; пары нет",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История государства и права зарубежных стран",
            "kind": "практика",
            "teacher": "Кутателадзе З.К.",
            "room": "М-207",
            "note": "10.10.2026; пары нет",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "ИС-26",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Дискретная математика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика и программирование",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "room": "М-109",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Дискретная математика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информатика и программирование",
            "kind": "лабораторная",
            "teacher": "Дыптан Е.А.",
            "room": "М-308",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-406",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Самплина В.Р.",
            "room": "М-309",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-309",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "ИЭ-26",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-101",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-401",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Дискретная математика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика и программирование",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "room": "М-109",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Дискретная математика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-309",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информатика и программирование",
            "kind": "лабораторная",
            "teacher": "Дыптан Е.А.",
            "room": "М-308",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-406",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-401",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Самплина В.Р",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "МН-26",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-201",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы правового регулирования управленческой и предпринимательской деятельности",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы правового регулирования управленческой и предпринимательской деятельности",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория менеджмента",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теория менеджмента",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "room": "М-207",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория менеджмента",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория менеджмента",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "01.10; Информатика",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-309",
            "note": "15.10.2026",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "odd"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-308",
            "weeks": [
              4
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Юрченко А.А.; Носкова Е.М.; Носкова Е.М.",
            "room": "М-411",
            "note": "03.10.2026",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Юрченко А.А.; Носкова Е.М.; Носкова Е.М.",
            "room": "М-411",
            "note": "03.10.2026",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Юрченко А.А.; Носкова Е.М.",
            "room": "М-411",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Юрченко А.А.; Носкова Е.М.",
            "room": "М-411",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ]
      }
    },
    {
      "name": "ЭК-26-1",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Навыки и технологии публичных презентаций",
            "kind": "лекция",
            "teacher": "Коленова В.А.",
            "room": "https://teams.microsoft.com/meet/348865167362970?p=YXItOUz5jpxYYstoy5",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Навыки и технологии публичных презентаций",
            "kind": "практика",
            "teacher": "Коленова В.А.",
            "room": "https://teams.microsoft.com/meet/348865167362970?p=YXItOUz5jpxYYstoy5",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-408",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-207",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Юрченко А.А.; Носкова Е.М.; Носкова Е.М.",
            "room": "М-411",
            "note": "03.10.2026",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Юрченко А.А.; Носкова Е.М.; Носкова Е.М.",
            "room": "М-411",
            "note": "03.10.2026",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Юрченко А.А.; Носкова Е.М.",
            "room": "М-411",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Юрченко А.А.; Носкова Е.М.",
            "room": "М-411",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ]
      }
    },
    {
      "name": "ЭК-26-2",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Навыки и техологии публичных презентаций",
            "kind": "лекция",
            "teacher": "Коленова В.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              9,
              11,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Навыки и техологии публичных презентаций",
            "kind": "практика",
            "teacher": "Коленова В.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              9,
              11,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономическая теория (микроэкономика, макроэкономика)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              13,
              15
            ]
          }
        ],
        "thu": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Носкова Е.М; Юрченко А.А.",
            "room": "М-411",
            "note": "15.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Страхование",
            "kind": "лекция",
            "teacher": "Носкова Е.М; Юрченко А.А.",
            "room": "М-411",
            "note": "15.10.2026; пары нет",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Носкова Е.М; Юрченко А.А.",
            "room": "М-411",
            "note": "16.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Страхование",
            "kind": "практика",
            "teacher": "Носкова Е.М; Юрченко А.А.",
            "room": "М-411",
            "note": "16.10.2026; пары нет",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Навыки и техологии публичных презентаций",
            "kind": "лекция",
            "teacher": "Коленова В.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Навыки и техологии публичных презентаций",
            "kind": "практика",
            "teacher": "Коленова В.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информатика",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-26-1",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-222",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н.",
            "room": "М-406",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-309",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-309",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Инженерная и компьютерная графика Лаговская Е.В. (за 18 нед.)",
            "kind": "практика",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Экономика",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Инженерная и компьютерная графика Лаговская Е.В. (за 18 нед.)",
            "kind": "лекция",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Инженерная и компьютерная графика Лаговская Е.В. (за 18 нед.)",
            "kind": "практика",
            "room": "М-406",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "room": "М-210",
            "week": "even"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "room": "М-210",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-401",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-101",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭЭ-26-2",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Экономика",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              13
            ]
          }
        ],
        "tue": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Экономика",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "note": "17.10.2026; пары нет; с 15.30",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "note": "17.10.2026; пары нет; с 15.30",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "note": "17.10.2026; пары нет; с 17.10",
            "weeks": [
              5,
              6,
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "АП-25 (6,9,12,15)",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Средства автоматизации и управления",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "note": "19.10.2026; пары нет; с 17.10",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3884841483980342?p=eOUJRN61tLyEPYHoRR",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Средства автоматизации и управления",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "note": "19.10.2026; пары нет; с 18.50",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Средства автоматизации и управления",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "note": "с 20.30",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Средства автоматизации и управления",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "note": "19.10.2026; пары нет; С 20.30",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3349272690132061?p=H0fFWNWRNzo0E9jKAu",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/394176825571995?p=GjS9lQqFDV6bqG1rLH",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы электроники",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              8,
              10,
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы электроники",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы электроники",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              8,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы электроники",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы электроники",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "weeks": [
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              8,
              14,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-205",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-209",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социология",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Социология",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              8
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–22:00",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Социология",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социология",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-206",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-109",
            "weeks": [
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              10,
              14,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-109",
            "weeks": [
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              14
            ]
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              8,
              10,
              14,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГП-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "лекция",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Трудовое право",
            "kind": "лекция",
            "teacher": "Кудрань Ю.А.",
            "room": "М-211",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Трудовое право",
            "kind": "практика",
            "teacher": "Кудрань Ю.А.",
            "room": "М-211",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-301",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "room": "М-211",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "лекция",
            "teacher": "Кабышева Н.А.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык в сфере юриспруденции",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-401",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экологическое право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-101",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Экологическое право",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-207",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Право социального обеспечения",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Право социального обеспечения",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-404",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Семейное право",
            "kind": "лекция",
            "teacher": "Кудрань Ю.А.",
            "room": "М-206",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Семейное право",
            "kind": "практика",
            "teacher": "Кудрань Ю.А.",
            "room": "М-206",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Административное право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Корпоративное право",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-303",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Системы искусственного интеллекта",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Корпоративное право",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-303",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Системы искусственного интеллекта",
            "kind": "лабораторная",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Административное право",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Системы искусственного интеллекта",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Уголовное право (общая часть)",
            "kind": "лекция",
            "teacher": "Маргаритова Р.С.",
            "note": "10.10.2026; пары нет",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Уголовное право (общая часть)",
            "kind": "практика",
            "teacher": "Маргаритова Р.С.",
            "note": "17.10.2026; пары нет",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ИС-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/323698010090248?p=Y1MY4LHG62xgUVMOP5",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/338272732167412?p=D5yM3fizvSrUi9TpH6",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М206",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Операционные системы и сети",
            "kind": "практика",
            "teacher": "Цуканов Г.К.",
            "room": "ЭИОС",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Логическое программирование",
            "kind": "лекция",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Логическое программирование",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "odd"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Операционные системы и сети",
            "kind": "лекция",
            "teacher": "Цуканов Г.К.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организационно-правовое обеспечение информационных систем",
            "kind": "лекция",
            "teacher": "Сидельников М.Э",
            "room": "М-307",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организационно-правовое обеспечение информационных систем",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория информационных процессов и систем",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектный практикум",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория информационных процессов и систем",
            "kind": "лекция",
            "teacher": "Варламова Т.Е.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проектный практикум",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-309",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ИЭ-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-103",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-103",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3219938632137034?p=TCGpLysutAAzhiQVKT",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/338272732167412?p=D5yM3fizvSrUi9TpH6",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-207",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М206",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Операционные системы и сети",
            "kind": "практика",
            "teacher": "Цуканов Г.К.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровые технологии: от интернета до Блокчейна",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Цифровые технологии: от интернета до Блокчейна",
            "kind": "лекция",
            "teacher": "Громов В.А",
            "room": "М-312",
            "week": "odd"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Операционные системы и сети",
            "kind": "лекция",
            "teacher": "Цуканов Г.К.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономическая теория",
            "kind": "лекция",
            "teacher": "Торгашова Н.А",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Экономическая теория",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Проектный практикум",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектный практикум",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория информационных процессов и систем",
            "kind": "лекция",
            "teacher": "Варламова Т.Е.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория информационных процессов и систем",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "room": "М-307",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "МН-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Документирование управленческой деятельности",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Документирование управленческой деятельности",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Статистика",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Бухгалтерский учет",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-103",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономика организаций (предприятий)",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Бухгалтерский учет",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-103",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-210",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Налоги и налогообложение",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Налоги и налогообложение",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "room": "М-103",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика организаций (предприятий)",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-103",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Деловой иностранный язык",
            "kind": "лекция",
            "teacher": "Кострицына Н.А.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление внешнеэкономической деятельностью Кулян Р.А. 17.10; перенос на 14.11; 28.11",
            "kind": "лекция",
            "room": "М-201",
            "note": "31.10.2026",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "перенос на ; 05.12",
            "room": "М-201",
            "weeks": [
              9
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "14.11; 28.11; 05.12; Управление внешнеэкономической деятельностью",
            "kind": "практика, лекция",
            "teacher": "Кулян Р.А.",
            "note": "12.12.2026",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭК-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Статистика",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Экономика организаций (предприятий)",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика организаций (предприятий)",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-210",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3599569326205544?p=f0QszSFpQI4I1ziIMy",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-103",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-103",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "room": "М-103",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Деловой иностранный язык",
            "kind": "лекция",
            "teacher": "Кострицына Н.А.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация деятельности Центрального Банка",
            "kind": "лекция",
            "teacher": "Кулян Р.А.",
            "note": "06.11.2026; с 18.50",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация деятельности Центрального Банка",
            "kind": "практика",
            "teacher": "Кулян Р.А.",
            "note": "06.11.2026; с 20.30",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы внешнеэкономической деятельности Кулян Р.А. 17.10; перенос на 07.11; 21.11",
            "kind": "лекция",
            "room": "М-103",
            "note": "31.10.2026",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              8
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы внешнеэкономической деятельности Кулян Р.А. 17.10; перенос на 07.11; 21.11",
            "kind": "практика",
            "room": "М-103",
            "note": "31.10.2026",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "07.11; 21.11 - Основы внешнеэкономической деятельности",
            "kind": "лекция",
            "teacher": "Кулян Р.А",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "07.11; 21.11 - Основы внешнеэкономической деятельности",
            "kind": "лекция",
            "teacher": "Кулян Р.А",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "07.11; 21.11 - Основы внешнеэкономической деятельности",
            "kind": "лекция",
            "teacher": "Кулян Р.А",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭЭ-25 (6,9,12,15)",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Техническая механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Техническая механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Метрология, стандартизация, сертификация и управление качеством",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3800292789713872?p=Hvk0lS9XOfLczbXeMX",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Метрология, стандартизация, сертификация и управление качеством",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3884841483980342?p=eOUJRN61tLyEPYHoRR",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3417429997184341?p=CtMOcGHwrZgIZaTAcc",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Техническая механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              8,
              10,
              11,
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Техническая механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              8,
              10,
              11,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Метрология, стандартизация, сертификация и управление качеством",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/394176825571995?p=GjS9lQqFDV6bqG1rLH",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Метрология, стандартизация, сертификация и управление качеством",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              17,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретические основы электротехники",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретические основы электротехники",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретические основы электротехники",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретические основы электротехники",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теоретические основы электротехники",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "room": "М-213",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теоретические основы электротехники",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-406",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-205",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              2,
              4,
              8,
              10,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-209",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-209",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-103",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-103",
            "weeks": [
              5,
              7,
              11,
              13
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–22:00",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "room": "М-209",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "room": "М-209",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              10,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "room": "М-209",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "room": "М-209",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Вагабов М.А.",
            "room": "М-101",
            "weeks": [
              5,
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Вагабов М.А.",
            "weeks": [
              8,
              10,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "АП-24 (11,14,17)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория автоматического управления",
            "kind": "практика",
            "teacher": "Петров А.М.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              10,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теория автоматического управления",
            "kind": "практика",
            "teacher": "Петров А.М.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехника и электроника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "weeks": [
              9,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Программное обеспечение систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              12,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Программное обеспечение систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "weeks": [
              9,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехника и электроника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технические измерения и приборы",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технические измерения и приборы",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Программное обеспечение систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Программное обеспечение систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Программное обеспечение систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Программное обеспечение систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              16
            ]
          }
        ]
      }
    },
    {
      "name": "ИС-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Цуканов Г.К",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Цуканов Г.К.",
            "room": "ЭИОС",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы принятия оптимальных решений",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы принятия оптимальных решений",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "18.00 Корпоративные информационные системы",
            "kind": "лекция",
            "teacher": "Азова И.А.",
            "room": "М-309",
            "note": "с 16.30",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "19.40 Корпоративные информационные системы",
            "kind": "практика",
            "teacher": "Азова И.А.",
            "room": "М-309",
            "note": "с 18.10",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "WEB-программирование",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Эконометрика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-109",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "WEB-программирование",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "WEB-программирование",
            "kind": "лекция",
            "teacher": "Громов В.А.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Эконометрика",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математическое и имитационное моделирование",
            "kind": "практика",
            "teacher": "Семенов Т.В.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Базы данных",
            "kind": "лекция",
            "teacher": "Варламова Т.Е.",
            "room": "М-308",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математическое и имитационное моделирование",
            "kind": "лекция",
            "teacher": "Семенов Т.В.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Базы данных",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Базы данных",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "room": "М-309",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "ИЭ-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Бухгалтерский, налоговый и управленческий учет",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-408",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Бухгалтерский, налоговый и управленческий учет",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-206",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Бухгалтерский, налоговый и управленческий учет",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-408",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информационный менеджмент",
            "kind": "лекция",
            "teacher": "Семенов Т.В.",
            "room": "М-307",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Информационный менеджмент",
            "kind": "практика",
            "teacher": "Семенов Т.В.",
            "room": "М-307",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Методы принятия оптимальных решений",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы принятия оптимальных решений",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-309",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Эконометрика",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М--307",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Эконометрика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-109",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "WEB-программирование",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-308",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "WEB-программирование",
            "kind": "лекция",
            "teacher": "Громов В.А.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "WEB-программирование",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Базы данных",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Базы данных",
            "kind": "лекция",
            "teacher": "Варламова Т.Е.",
            "room": "М-308",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математическое и имитационное моделирование",
            "kind": "лекция",
            "teacher": "Семенов Т.В.",
            "room": "М-308",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математическое и имитационное моделирование",
            "kind": "практика",
            "teacher": "Семенов Т.В",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Базы данных",
            "kind": "практика",
            "teacher": "Варламова Т.Е.",
            "room": "М-307",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "МН-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Финансовые рынки и институты",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Финансовые рынки и институты",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-411",
            "weeks": [
              10
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              9
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              10
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "перенос на",
            "room": "М-406",
            "weeks": [
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-209",
            "weeks": [
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-209",
            "weeks": [
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-209",
            "weeks": [
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организация производства",
            "kind": "лекция",
            "teacher": "Долженко Е.Н",
            "room": "М-404",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организация производства",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-404",
            "weeks": [
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Управление качеством",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "room": "М-404",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организация производства",
            "kind": "лекция",
            "teacher": "Долженко Е.Н",
            "room": "М-404",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-404",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-404",
            "weeks": [
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Организация производства",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-409",
            "note": "15.10.2026",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-409",
            "note": "15.10.2026",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономическая оценка инвестиций",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономическая оценка инвестиций",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономическая оценка инвестиций",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-213",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Управление инновациями",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление инновациями",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-409",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭК-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-409",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Инновационный менеджмент",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Инновационный менеджмент",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "10.12.; Биржевое дело",
            "kind": "практика, лекция",
            "teacher": "Носкова Е.М.",
            "note": "24.12.2026",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-201",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-409",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "room": "М-201",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономическая оценка инвестиций",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Экономическая оценка инвестиций",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-409",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Антиризисное управление",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "ЭЭ-24 (11,14,17)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электроэнергетические системы и сети",
            "kind": "практика",
            "teacher": "Петров А.М.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "лабораторная",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              12,
              16
            ]
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Переходные процессы",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Переходные процессы",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электроэнергетические системы и сети",
            "kind": "практика",
            "teacher": "Петров А.М.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электрические машины",
            "kind": "лабораторная",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Переходные процессы",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Переходные процессы",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              9,
              13,
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электробезопасность",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "note": "с 18.50",
            "weeks": [
              9
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электробезопасность",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "note": "с 18.50",
            "weeks": [
              10
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электробезопасность",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "note": "с 20.30",
            "weeks": [
              9
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электробезопасность",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "note": "с 20.30",
            "weeks": [
              10
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электробезопасность",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электробезопасность",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехнологии",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              10,
              12,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электротехнологии",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              10,
              12,
              15,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электротехнологии",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электротехнологии",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              12
            ]
          }
        ]
      }
    },
    {
      "name": "АП-23 (8,11,14,17)",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Цифровые устройства автоматики",
            "kind": "лекция",
            "teacher": "Пьяных Г.А.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Цифровые устройства автоматики",
            "kind": "практика",
            "teacher": "Пьяных Г.А.",
            "weeks": [
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Цифровые устройства автоматики",
            "kind": "практика",
            "teacher": "Пьяных Г.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-312",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              7,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-312",
            "weeks": [
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-307",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "CASE средства при проектировании систем управления",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы микропроцессорной техники",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-309",
            "note": "с 12.10",
            "weeks": [
              7,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы микропроцессорной техники",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-309",
            "note": "с 12.10",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "note": "С 13.50",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "note": "С 13.50",
            "weeks": [
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "note": "С 15.30",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Ф-в: Механотроника",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "note": "с 15.30",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технологические процессы автоматизированных производств",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "note": "С 17.10",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Ф-в: Механотроника",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "note": "с 17.10",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Синтез систем управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Синтез систем управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Ф-в: Механотроника",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              7,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Ф-в: Механотроника",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Синтез систем управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Синтез систем управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Синтез систем управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "note": "с 13.50",
            "weeks": [
              7,
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Синтез систем управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "note": "с 15.30",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы микропроцессорной техники",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Автоматизация технологических процессов и производств",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы микропроцессорной техники",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровые устройства автоматики",
            "kind": "лекция",
            "teacher": "Пьяных Г.А.",
            "room": "М-211",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровые устройства автоматики",
            "kind": "практика",
            "teacher": "Пьяных Г.А.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Цифровые устройства автоматики",
            "kind": "практика",
            "teacher": "Пьяных Г.А.",
            "room": "М-211",
            "weeks": [
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы микропроцессорной техники",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-211",
            "weeks": [
              7,
              9,
              10,
              12
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Цифровые устройства автоматики",
            "kind": "практика",
            "teacher": "Пьяных Г.А.",
            "weeks": [
              15,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "ДМ-23",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Цифровая трансформация бизнеса",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Цифровая трансформация бизнеса",
            "kind": "практика",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровая трансформация бизнеса",
            "kind": "практика",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-308",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Разработка маркетинговой стратегии",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-210",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Разработка маркетинговой стратегии",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "room": "М-210",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Разработка маркетинговой стратегии",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "room": "М-210",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Разработка маркетинговой стратегии",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-210",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Юнит-экономика и модели выхода на рынок",
            "kind": "лекция",
            "teacher": "Юрченко А.А.",
            "room": "М-409",
            "note": "с 18.30",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Юнит-экономика и модели выхода на рынок",
            "kind": "лекция",
            "teacher": "Юрченко А.А.",
            "room": "М-409",
            "note": "с 20.00",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Стратегический маркетинг",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "room": "М-406",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Стратегический маркетинг",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-406",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Стратегический маркетинг",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "room": "М-406",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Юнит-экономика и модели выхода на рынок",
            "kind": "практика",
            "teacher": "Юрченко А.А.",
            "room": "М-411",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Юнит-экономика и модели выхода на рынок",
            "kind": "практика",
            "teacher": "Юрченко А.А.",
            "room": "М-411",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ИС-23",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Методы и средства проектирования информационных систем",
            "kind": "лекция",
            "teacher": "Громов В.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы и средства проектирования информационных систем",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Многомерный анализ данных",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Разработка мобильных приложений",
            "kind": "лекция",
            "teacher": "Феденко А.О.",
            "room": "М-307",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Разработка мобильных приложений",
            "kind": "практика",
            "teacher": "Феденко А.О.",
            "room": "М-307",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Интеллектуальные информационные системы",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Интеллектуальные информационные системы",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Интеллектуальные информационные системы",
            "kind": "практика",
            "teacher": "Дыптан Е.А.",
            "room": "М-301",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Интеллектуальные информационные системы",
            "kind": "практика",
            "teacher": "Дыптан Е.А.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технологии программирования",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "room": "М-312",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технологии программирования",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-303",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Многомерный анализ данных",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-201",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Платформенные решения для цифровой трансформации производственно-логистических систем",
            "kind": "лекция",
            "teacher": "Тимошенко Д.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Платформенные решения для цифровой трансформации производственно-логистических систем",
            "kind": "практика",
            "teacher": "Тимошенко Д.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Разработка мобильных приложений",
            "kind": "практика",
            "teacher": "Феденко А.О.",
            "room": "М-303",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Разработка мобильных приложений",
            "kind": "лекция",
            "teacher": "Феденко А.О.",
            "room": "М-312",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "ИЭ-23",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Методы и средства проектирования информационных систем",
            "kind": "лекция",
            "teacher": "Громов В.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Интеллектуальные информационные системы",
            "kind": "практика",
            "teacher": "Дыптан Е.А.",
            "room": "М-307",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы и средства проектирования информационных систем",
            "kind": "практика",
            "teacher": "Громов В.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Многомерный анализ данных",
            "kind": "практика",
            "teacher": "Самплина В.Р.",
            "room": "М-307",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Интеллектуальные информационные системы",
            "kind": "практика",
            "teacher": "Дыптан Е.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Интеллектуальные информационные системы",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Интеллектуальные информационные системы",
            "kind": "лекция",
            "teacher": "Дыптан Е.А.",
            "room": "М-309",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии в экономике",
            "kind": "лекция",
            "teacher": "Семенов Т.В.",
            "room": "М-209",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Информационные технологии в экономике",
            "kind": "практика",
            "teacher": "Семенов Т.В.",
            "room": "М-209",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологии программирования",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "room": "М-307",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технологии программирования",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "room": "М-312",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Многомерный анализ данных",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-201",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальная информатика",
            "kind": "лекция",
            "teacher": "Тимошенко Д.А.",
            "room": "М-304",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальная информатика",
            "kind": "практика",
            "teacher": "Тимошенко Д.А.",
            "room": "М-309",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭК-23",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Комплексный анализ хозяйственной деятельности",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексный анализ хозяйственной деятельности",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-210",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-210",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Оценка стоимости бизнеса",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "М-409",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Оценка стоимости бизнеса",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "М-409",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Функционально-стоимостной анализ",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Функционально-стоимостной анализ",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-408",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Аудит",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-207",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "note": "с 17.10",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "note": "С 17.10",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Антикризисное управление",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "note": "с 17.10",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Аудит",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аудит",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "ЭП-23 (8,11,14,17)",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "note": "с 18.50",
            "weeks": [
              7,
              9,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрические и электронные аппараты",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "note": "с 18.50",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрические и электронные аппараты",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "note": "с 18.50",
            "weeks": [
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              7,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              16,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "room": "М-211",
            "note": "с 18.50",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "note": "с 18.50",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "note": "с 18.50",
            "weeks": [
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "room": "М-211",
            "note": "с 18.50",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "note": "С 18.50",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "note": "С 18.50",
            "weeks": [
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "room": "М-211",
            "note": "с 20.30",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "note": "С 20.30",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "note": "С 20.30",
            "weeks": [
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Воробьев М.С",
            "room": "М-213",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электроснабжение",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "room": "М-213",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электроснабжение",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "room": "М-213",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электрические и электронные аппараты",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрические и электронные аппараты",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электроснабжение",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электрические и электронные аппараты",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "note": "с 15.30",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Электроснабжение",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "note": "с 17.10",
            "weeks": [
              9,
              13,
              15
            ]
          }
        ]
      }
    },
    {
      "name": "ИП-26-2",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              16,
              17,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              6,
              8,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              6,
              8,
              10,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-109",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-109",
            "weeks": [
              15,
              16,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              15,
              16,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Химия",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в инжиниринг и реинжиринг",
            "kind": "лекция",
            "teacher": "Лаговская Е.В",
            "room": "М-103",
            "note": "с 15.30",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в инжиниринг и реинжиринг",
            "kind": "практика",
            "teacher": "Лаговская Е.В",
            "room": "М-103",
            "note": "с 15.30",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Введение в инжиниринг и реинжиринг",
            "kind": "лекция",
            "teacher": "Лаговская Е.В",
            "room": "М-103",
            "note": "с 17.10",
            "weeks": [
              5,
              6,
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "СА-26-2",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              16,
              17,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная геодезия",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "room": "М-201",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная геодезия",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "room": "М-201",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "weeks": [
              6,
              8,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              6,
              8,
              10,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-109",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-109",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная геодезия",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "room": "М-201",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "weeks": [
              15,
              16,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Химия",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Инженерная гология и экология",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Инженерная гология и экология",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-26-2",
      "course": 1,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Неорганическая химия",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "weeks": [
              10,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Неорганическая химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Неорганическая химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физическая культура и спорт",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Иванова З.Н",
            "weeks": [
              5,
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              14,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Кабышева М.И.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              7,
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-222",
            "weeks": [
              6,
              8,
              10,
              12,
              14,
              16,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Неорганическая химия",
            "kind": "лекция",
            "teacher": "Черемисин А.А.; Плотников С.С.",
            "room": "М-301",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Неорганическая химия",
            "kind": "практика",
            "teacher": "Черемисин А.А.; Плотников С.С.",
            "room": "М-301",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              15,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Неорганическая химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Бодрякова Л.Н.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информатика",
            "kind": "практика",
            "teacher": "Бодрякова Л.Н.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГД-25-1",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов Лозовский Э.Р. Основы горного дела",
            "kind": "лекция",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы горного дела",
            "kind": "лекция",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы горного дела",
            "kind": "практика",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Горнопромышленная экология Лозовский Э.Р. Основы горного дела",
            "kind": "практика",
            "teacher": "Мезенцев А.Ю",
            "room": "М-201",
            "note": "08.10.2026",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "перенос на",
            "weeks": [
              8
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Горнопромышленная экология",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "note": "05.11.2026",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Геология",
            "kind": "лекция",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Геология",
            "kind": "лабораторная",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Геология",
            "kind": "практика",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "ГД-25-2",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов Лозовский Э.Р. Основы горного дела",
            "kind": "лекция",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "note": "07.10.2026",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы горного дела",
            "kind": "лекция",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы горного дела",
            "kind": "практика",
            "teacher": "Мезенцев А.Ю.",
            "room": "М-201",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Горнопромышленная экология Лозовский Э.Р. Основы горного дела",
            "kind": "практика",
            "teacher": "Мезенцев А.Ю",
            "room": "М-201",
            "note": "08.10.2026",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "перенос на",
            "weeks": [
              8
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Горнопромышленная экология",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "note": "05.11.2026",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Геология",
            "kind": "лекция",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Геология",
            "kind": "лабораторная",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Геология",
            "kind": "практика",
            "teacher": "Ахмадеев Г.Х.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Устинов А.К.",
            "room": "М-201",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "ИП-25",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "перенос на",
            "room": "М-109",
            "weeks": [
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "П-110",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-206",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "room": "М-405",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "П-110",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А",
            "note": "09.11.2026",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "П-110",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "П-110",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/361360758871320?p=Hu0zPDlO0LJf29KVdm",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология конструкционных материалов Леонтьев В.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "лекция",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология конструкционных материалов Леонтьев В.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "практика",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-411",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-109",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-411",
            "week": "even"
          }
        ],
        "fri": [
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Экология",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "room": "М-101",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Экология",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "room": "М-101",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Компьютерная графика",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "room": "М-301",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Компьютерная графика",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "room": "М-301",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/313429810134136?p=i7auH28WyNcg7QKakP",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "СА-25-1,2 (7,10,13,16)",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы технической механики",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-411",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Строительные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "room": "М-404",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационные технологии в архитектуре",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы технической механики",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-411",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-206",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-401",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Строительные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-109",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы технической механики",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/38459175106567?p=pvlgcMrL4XeiBoK8j1",
            "weeks": [
              6,
              8
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/38459175106567?p=pvlgcMrL4XeiBoK8j1",
            "weeks": [
              12,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-209",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационные технологии в архитектуре",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы технической механики",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "weeks": [
              11,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/328963422283305?p=0zX0eTmoPMfXEccPeB",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3804852383960917?p=lF5fx9YB0dc7gY6CwL",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика, лекция",
            "teacher": "Преображенский А.В.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-211",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-211",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Строительные материалы",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "room": "М-211",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-211",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Строительные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "room": "М-211",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Информационные технологии в архитектуре",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Информационные технологии в архитектуре",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              14,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Строительные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Строительные материалы",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              11,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Строительные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "weeks": [
              11,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              12,
              14
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              6,
              8,
              9,
              12,
              14,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Архитектурно-строительное проектирование зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-25 (7,10,13,16)",
      "course": 2,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Общие химические технологии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Общие химические технологии",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "note": "19.10.2026; пары нет",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-409",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Физическая химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-103",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физическая химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "note": "28.09.2026; пары нет",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-103",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-206",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Федоров А.А.",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физическая химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-411",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Общие химические технологии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Общие химические технологии",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "note": "06.10.2026; пары нет",
            "weeks": [
              6,
              8
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-411",
            "weeks": [
              6,
              8,
              9,
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология командообразования",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "note": "С 12.10",
            "weeks": [
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология командообразования",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "note": "С 12.10",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология командообразования",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "note": "с 13.50",
            "weeks": [
              9,
              11,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология командообразования",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "note": "с 13.50",
            "weeks": [
              6,
              8,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "note": "с 15.30",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "note": "с 15.30",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Методы контроля и анализа веществ",
            "kind": "лекция",
            "teacher": "Николаева Ю.А.",
            "note": "С 17.10",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Методы контроля и анализа веществ",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "С 17.10",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "note": "с 17.10",
            "weeks": [
              11,
              15
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "kind": "практика",
            "teacher": "Кабышева М.И.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-407",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Физическая химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "room": "М-407",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/375204536268951?p=iaBQZSgawnAWyhMwIr",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/375204536268951?p=iaBQZSgawnAWyhMwIr",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              15,
              17
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Федоров А.А.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-206",
            "weeks": [
              6,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "weeks": [
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "weeks": [
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Аналитическая химия",
            "kind": "лекция",
            "teacher": "Охтеменко И.Н.",
            "note": "с 17.10",
            "weeks": [
              9,
              11,
              13,
              15
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "с. 18.50 Аналитическая химия",
            "kind": "лабораторная",
            "teacher": "Охтеменко И.Н.",
            "weeks": [
              9,
              11,
              13,
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Аналитическая химия",
            "kind": "лекция",
            "teacher": "Охтеменко И.Н.",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Аналитическая химия",
            "kind": "лабораторная",
            "teacher": "Охтеменко И.Н.",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/43402275123090",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы контроля и анализа веществ",
            "kind": "лекция",
            "teacher": "Николаева Ю.А.",
            "note": "03.10.2026; пары нет",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/43402275123090",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы контроля и анализа веществ",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "03.10.2026; пары нет",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/43402275123090",
            "weeks": [
              2,
              4,
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/380108986920594?p=w1E3O3T7bU35416grK",
            "weeks": [
              1,
              3,
              5,
              9,
              11,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-24 (8,11,14,17)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "room": "М-201",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Физико-химическая геотехнология",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Физико-химическая геотехнология",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "room": "М-201",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физико-химическая геотехнология",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физико-химическая геотехнология",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физико-химическая геотехнология",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              13,
              15,
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр",
            "kind": "лекция",
            "teacher": "Туртыгина Н.А.",
            "room": "М-411",
            "weeks": [
              6,
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр Туртыгина Н.А. Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-205",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр Туртыгина Н.А. Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-205",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Квалиметрия недр",
            "kind": "практика",
            "teacher": "Туртыгина Н.А.",
            "room": "М-205",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-409",
            "weeks": [
              6,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "note": "с 18.50",
            "weeks": [
              7,
              9
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-405",
            "note": "С 18.50",
            "weeks": [
              6,
              10,
              16
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "note": "с 20.30",
            "weeks": [
              7,
              9,
              10
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              9,
              10,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Квалиметрия недр",
            "kind": "лекция",
            "teacher": "Туртыгина Н.А.",
            "weeks": [
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Квалиметрия недр",
            "kind": "практика",
            "teacher": "Туртыгина Н.А.",
            "weeks": [
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр",
            "kind": "практика",
            "teacher": "Туртыгина Н.А.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-206",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-206",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              9
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теплотехника",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теплотехника",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "ИП-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы технологии машиностроения Чаава М.М. -18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "kind": "лекция",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы технологии машиностроения Чаава М.М. -18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "kind": "практика",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Металлургические подъемно-транспортные машины Никоноров Л.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "лекция",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Системы пыле-газоочистки в металлургии",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургические подъемно-транспортные машины Никоноров Л.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "практика",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Системы пыле-газоочистки в металлургии",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургические подъемно-транспортные машины Никоноров Л.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "практика",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Детали машин",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "room": "М-109",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Детали машин",
            "kind": "лабораторная",
            "teacher": "Белоконев К.И.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Детали машин",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "М-109",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технологические линии и комплексы металлургических производств",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "room": "М-109",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технологические линии и комплексы металлургических производств",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "room": "М-109",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "12.00 Защита результатов производственной практики",
            "room": "У-216",
            "note": "16.10.2026; с 10.00",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрологическое обеспечение производства",
            "kind": "лекция",
            "teacher": "Осипенко А.А.",
            "room": "М-109",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Метрологическое обеспечение производства",
            "kind": "лекция",
            "teacher": "Осипенко А.А.",
            "room": "М-109",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электрический привод металлургических машин",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электрический привод металлургических машин",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "МД-24 (8,11,14,17)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "room": "М-201",
            "weeks": [
              7,
              9,
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "У-101",
            "note": "С 18.50",
            "weeks": [
              6,
              7,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "У-101",
            "note": "С 18.50",
            "weeks": [
              10,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "note": "с 20.30",
            "weeks": [
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерия Кокошка И.П. Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерия Кокошка И.П. Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "weeks": [
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркшейдерия",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "note": "с 20.30",
            "weeks": [
              7,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр Туртыгина Н.А. Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-205",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Квалиметрия недр Туртыгина Н.А. Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-205",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-101",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Метрология, стандартизация и сертификация в горном деле",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-409",
            "weeks": [
              6,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Высшая геодезия",
            "kind": "практика",
            "teacher": "Семенякина Н.В.",
            "note": "С 20.30",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология и безопасность взрывных работ Корецкий А.С. Высшая геодезия",
            "kind": "лекция",
            "teacher": "Семенякина Н.В.",
            "room": "М-405",
            "note": "с 18.50",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология и безопасность взрывных работ Корецкий А.С. Высшая геодезия",
            "kind": "лекция",
            "teacher": "Семенякина Н.В.",
            "room": "М-405",
            "note": "с 18.50",
            "weeks": [
              9,
              10,
              12,
              13,
              15
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              9,
              10,
              12,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "20.20 Маркшейдерия",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "note": "с 18.50",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "20.20 Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "note": "с 18.50",
            "weeks": [
              7,
              9
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-201",
            "note": "с 18.50",
            "weeks": [
              6
            ]
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерия",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркшейдерия",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "weeks": [
              10,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркшейдерия",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "weeks": [
              10,
              12,
              13,
              15,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Высшая геодезия",
            "kind": "лекция",
            "teacher": "Семенякина Н.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-205",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-205",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Высшая геодезия",
            "kind": "практика",
            "teacher": "Семенякина Н.В.",
            "room": "М-206",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теплотехника",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теплотехника",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "СА-24 (9,12,15)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "weeks": [
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основания и фундаменты зданий, сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "weeks": [
              11,
              13,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "room": "М-404",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              13,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "room": "М-404",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17,
              18
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Информационные технологии расчета строительных конструкций",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Архитектура Норильского промышленного района",
            "kind": "практика",
            "teacher": "Рагимова Р.К.",
            "note": "с 18.50",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Архитектура Норильского промышленного района",
            "kind": "практика",
            "teacher": "Рагимова Р.К.",
            "note": "С 18.50",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "weeks": [
              14,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "weeks": [
              14,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основания и фундаменты зданий, сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              7,
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Информационные технологии расчета строительных конструкций",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              11,
              13,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основания и фундаменты зданий, сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "weeks": [
              10,
              14,
              16
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Информационные технологии расчета строительных конструкций",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "weeks": [
              13,
              17
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              13,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              7,
              11,
              13,
              17
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основания и фундаменты зданий, сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-404",
            "weeks": [
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основания и фундаменты зданий, сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-404",
            "weeks": [
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии расчета строительных конструкций",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Строительная механика",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              10,
              11,
              13,
              14,
              16,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Информационные технологии расчета строительных конструкций",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              7,
              11,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Строительная механика",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              10,
              14,
              16,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Строительная механика",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              10,
              11
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Строительная механика",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              13,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы водоснабжения и водоотведения",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              8,
              10
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы водоснабжения и водоотведения",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "weeks": [
              8,
              10,
              11
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы водоснабжения и водоотведения",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы водоснабжения и водоотведения",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "room": "М-404",
            "weeks": [
              7,
              8,
              10,
              11,
              13,
              14,
              16,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы водоснабжения и водоотведения",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "weeks": [
              8,
              10,
              14,
              16,
              18
            ]
          }
        ]
      }
    },
    {
      "name": "СМ-24",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Строительные и дорожные машины",
            "kind": "лекция",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Строительные и дорожные машины",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Строительные и дорожные машины",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология машиностроения, производство и ремонт ПТС,ДМиО",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Грузоподъемные машины",
            "kind": "практика",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Грузоподъемные машины",
            "kind": "лекция",
            "teacher": "Курочкин А.И.",
            "week": "even"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Грузоподъемные машины",
            "kind": "практика",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Грузоподъемные машины",
            "kind": "лабораторная",
            "teacher": "Курочкин А.И.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Машины непрерывного транспорта",
            "kind": "лекция",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Машины непрерывного транспорта",
            "kind": "практика",
            "teacher": "Пыталев И.А.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/0760715799",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Основы экономики и управления предприятием",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "week": "even"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Основы экономики и управления предприятием",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-411",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Детали машин и основы конструирования",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "room": "М-109",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Детали машин и основы конструирования",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "М-109",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ТМ-24 (10,13,16)",
      "course": 3,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургия меди и никеля",
            "kind": "лекция",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургия меди и никеля",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия меди и никеля",
            "kind": "лекция",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              11,
              12,
              14,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Металлургия меди и никеля",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              11,
              12,
              14,
              15
            ]
          }
        ],
        "tue": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная физическая культура",
            "teacher": "Бацунов С.Н.",
            "room": "Айка",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургическое оборудование",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургическая теплотехника",
            "kind": "лекция",
            "teacher": "Бородин А.Д.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургическая теплотехника",
            "kind": "практика",
            "teacher": "Бородин А.Д.",
            "weeks": [
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Профессиональный иностранный язык (английский, немецкий)",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              12,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Профессиональный иностранный язык (английский, немецкий)",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              9,
              11,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория электрометаллургических процессов",
            "kind": "лекция",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория электрометаллургических процессов",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургическое оборудование",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория электрометаллургических процессов",
            "kind": "лекция",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теория электрометаллургических процессов",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургическое оборудование",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              11,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              12,
              14
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Производство никеля и кобальта",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Производство никеля и кобальта",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              11,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Производство никеля и кобальта",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              12,
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Производство никеля и кобальта Каверзин. А.В",
            "kind": "лекция",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургическая теплотехника",
            "kind": "лекция",
            "teacher": "Бородин А.Д.",
            "weeks": [
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургическая теплотехника",
            "teacher": "Бородин А.Д.",
            "weeks": [
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Металлургическая теплотехника",
            "kind": "лекция",
            "teacher": "Бородин А.Д.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Металлургическая теплотехника",
            "kind": "практика",
            "teacher": "Бородин А.Д.",
            "weeks": [
              14,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-23 (11,14,17)",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электротехника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "weeks": [
              12,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электротехника",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электротехника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электротехника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехника",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13,
              15,
              16,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "weeks": [
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Аэрология горных предприятий",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Аэрология горных предприятий",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Аэрология горных предприятий",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              12,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Аэрология горных предприятий",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              12,
              16,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Процессы подземной разработки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              16,
              18
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Подземная разработка месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Геомеханика",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Маркшейдерское дело",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Маркшейдерское дело",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Геомеханика",
            "kind": "практика",
            "teacher": "Устинов А.К.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Маркшейдерское дело",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Маркшейдерское дело",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Геомеханика",
            "kind": "лекция",
            "teacher": "Устинов А.К.",
            "weeks": [
              12,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Маркшейдерское дело",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              9,
              13,
              15
            ]
          }
        ]
      }
    },
    {
      "name": "ИП-23",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Триботехника",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "week": "both"
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Триботехника",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организация и проведение технического обслуживания и ремонта аддитивных установок",
            "kind": "практика",
            "teacher": "Белоконев К.И.",
            "room": "М-206",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организация и проведение технического обслуживания и ремонта аддитивных установок Белоконев К.И. -18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "kind": "лекция",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация и ведение технологического процесса создания изделий по компьютерной (цифровой) модели на аддитивных установках Богданов С.В. -18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "kind": "практика",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Организация и ведение технологического процесса создания изделий по компьютерной (цифровой) модели на аддитивных установках Богданов С.В. -18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "kind": "лекция",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "18.00 инженерный спринт-практикум \"Реверс-инжиниринг и изготовление функциональных прототипов\"",
            "room": "П-110",
            "note": "13.10.2026; с 09.00",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Инновационные технологии изготовления деталей",
            "kind": "лекция",
            "teacher": "Белоконев К.И.",
            "room": "М-211",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Инновационные технологии изготовления деталей Белоконев К.И. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "практика",
            "room": "П-110",
            "note": "14.10.2026; с 09.00",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "15.20 Экономика и управление машиностроительным производством Андреева Н.В. -18.00 методический семинар \"Интеграция проектного обучения, коммерциализация и грантовая поддержка лаборатории\"",
            "kind": "практика",
            "room": "П-110",
            "note": "14.10.2026; с 13.50; с 09.00",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "17.00 Экономика и управление машиностроительным производством",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "note": "с 15.30",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "17.00Экономика и управление машиностроительным производством",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-103",
            "note": "с 15.30",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Металлургические машины и оборудование",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургические машины и оборудование",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "room": "М-301",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Гидро и пневмопривод металлургических машин",
            "kind": "лекция",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Гидро и пневмопривод металлургических машин",
            "kind": "практика",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы автоматизированного конструирования металлургических машин",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "room": "М-301",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы автоматизированного конструирования металлургических машин",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "room": "М-301",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "СА-23 (7,10,13,16)",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлические конструкции",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-211",
            "weeks": [
              5,
              6,
              8,
              9
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-211",
            "weeks": [
              11,
              12,
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              11,
              12,
              14
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Социальная адаптация лиц с ограниченными возможностями в условиях профессиональной деятельности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-407",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-213",
            "weeks": [
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-407",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлические конструкции",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "weeks": [
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-206",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Организация, планирование и управление строительством",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Организация, планирование и управление строительством",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-206",
            "weeks": [
              6,
              8,
              12,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Металлические конструкции",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлические конструкции",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-401",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Социальная адаптация лиц с ограниченными возможностями в условиях профессиональной деятельности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальная адаптация лиц с ограниченными возможностями в условиях профессиональной деятельности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-207",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальная адаптация лиц с ограниченными возможностями в условиях профессиональной деятельности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация, планирование и управление строительством",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация, планирование и управление строительством",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "weeks": [
              17
            ]
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "weeks": [
              14,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "weeks": [
              14,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "weeks": [
              15,
              17
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Организация, планирование и управление строительством",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организация, планирование и управление строительством",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-23 (7,10,13,16)",
      "course": 4,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "room": "М-301",
            "weeks": [
              6,
              8,
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-301",
            "weeks": [
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "room": "М-210",
            "weeks": [
              6,
              8,
              12,
              14,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Территориальная организация металлургического комплекса",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Переработка техногенных ресурсов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          }
        ],
        "tue": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия редких металлов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия редких металлов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Производство меди",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Производство меди",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              8,
              12,
              14
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Экономика металлургического предприятия",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика металлургического предприятия",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика металлургического предприятия",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "weeks": [
              6,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика металлургического предприятия",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "weeks": [
              12,
              14,
              18
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика металлургического предприятия",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "weeks": [
              17
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Производство меди",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "note": "30.09.2026; пары нет",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Производство меди",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              8,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Производство меди",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Производство меди",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-411",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Коррозия и защита металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "note": "с 18.50",
            "weeks": [
              8,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Коррозия и защита металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "note": "с 18.50",
            "weeks": [
              14,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Коррозия и защита металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "note": "с 20.30",
            "weeks": [
              8,
              12,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Переработка техногенных ресурсов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургия редких металлов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              5,
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургия редких металлов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Металлургия редких металлов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-103",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургия редких металлов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-103",
            "weeks": [
              5,
              6,
              8,
              9,
              11,
              12,
              14,
              15,
              17,
              18
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия благородных металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "note": "с 18.50",
            "weeks": [
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия благородных металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "note": "с 20.30",
            "weeks": [
              8,
              9,
              11,
              12,
              14,
              15,
              17
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Коррозия и защита металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "weeks": [
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Металлургия благородных металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              11,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Коррозия и защита металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              6,
              8,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Металлургия благородных металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              11,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Коррозия и защита металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Коррозия и защита металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              12,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Металлургия благородных металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Коррозия и защита металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              8,
              12,
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Металлургия благородных металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              11,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-22 (11,14,17)",
      "course": 5,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектирование рудников",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12,
              13,
              15,
              16,
              18
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проектирование рудников",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Эксплуатация горных машин и оборудования",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектирование рудников",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              13,
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              13
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Организация горного производства",
            "kind": "лекция",
            "teacher": "Батралиев Р.Ш.",
            "note": "с 20.30",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Организация горного производства",
            "kind": "практика",
            "teacher": "Батралиев Р.Ш.",
            "note": "с 20.30",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организация горного производства",
            "kind": "лекция",
            "teacher": "Батралиев Р.Ш.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Организация горного производства",
            "kind": "практика",
            "teacher": "Батралиев Р.Ш.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              12,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "МД-22 (11,14,17)",
      "course": 5,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Организация маркшейдерской службы",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Организация маркшейдерской службы",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организация маркшейдерской службы",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организация маркшейдерской службы",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              10,
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Статистическая обработка маркшейдерско-геодезической информации",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Статистическая обработка маркшейдерско-геодезической информации",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              10,
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Статистическая обработка маркшейдерско-геодезической информации",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Статистическая обработка маркшейдерско-геодезической информации",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Анализ точности маркшейдерских съемок",
            "kind": "лекция",
            "teacher": "Семенякина Н.В.",
            "note": "с 20.30",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Анализ точности маркшейдерских съемок",
            "kind": "практика",
            "teacher": "Семенякина Н.В.",
            "note": "с 20.30",
            "weeks": [
              12,
              13,
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              13,
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Технология закладочных работ при подземной разработке",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              13
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              10,
              12,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              13,
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Анализ точности маркшейдерских съемок",
            "kind": "практика",
            "teacher": "Семенякина Н.В.",
            "weeks": [
              9,
              10,
              12,
              13,
              15,
              16
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Анализ точности маркшейдерских съемок",
            "kind": "лекция",
            "teacher": "Семенякина Н.В.",
            "weeks": [
              10,
              12,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-21",
      "course": 6,
      "level": "bachelor",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "26.10 и 09.11 - Технология подземной и комбинированной разарботки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технология подземной и комбинированной разарботки рудных месторождений Бибик С.Д. 19.10, 02.11 - перенос на 26.10 и 09.11",
            "kind": "лекция",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "26.10 и 09.11 - Технология подземной и комбинированной разарботки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология подземной и комбинированной разарботки рудных месторождений Бибик С.Д. 19.10, 02.11 - перенос на 26.10 и 09.11",
            "kind": "практика",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "АП-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "лекция",
            "teacher": "Бацунов С.Н.",
            "room": "М-207",
            "weeks": [
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "room": "М-207",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              13
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "weeks": [
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "weeks": [
              11,
              13,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы коропративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Янко Я.Ю.",
            "room": "М-103",
            "weeks": [
              7,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "room": "М-103",
            "weeks": [
              7,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "лекция",
            "teacher": "Бацунов С.Н.",
            "room": "М-207",
            "weeks": [
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "room": "М-207",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Янко Я.Ю.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "weeks": [
              13,
              14,
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              13
            ]
          }
        ]
      }
    },
    {
      "name": "АП-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование, ч.1",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование, ч.1",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерное моделирование",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "note": "14.10.2026; пары нет",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "note": "14.10.2026; пары нет",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы электроники",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы электроники",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ГП-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Уголовное право",
            "kind": "лекция",
            "teacher": "Маргаритова Р.С.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Уголовное право",
            "kind": "практика",
            "teacher": "Маргаритова Р.С.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экологическое право",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экологическое право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Уголовное право",
            "kind": "практика",
            "teacher": "Маргаритова Р.С.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экологическое право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Системы искусственого интеллекта",
            "kind": "лекция",
            "teacher": "Сидельников М.Э.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Системы искусственого интеллекта",
            "kind": "лабораторная",
            "teacher": "Сидельников М.Э.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Трудовое право",
            "kind": "лекция",
            "teacher": "Кудрань Ю.А.",
            "room": "П-415",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Трудовое право",
            "kind": "практика",
            "teacher": "Кудрань Ю.А.",
            "room": "П-415",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Системы искусственого интеллекта",
            "kind": "практика",
            "teacher": "Сидельников М.Э.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Системы искусственого интеллекта",
            "kind": "лабораторная",
            "teacher": "Сидельников М.Э.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Трудовое право",
            "kind": "практика",
            "teacher": "Кудрань Ю.А.",
            "room": "П-415",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Право интеллектуальной собственности",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Право социального обеспечения",
            "kind": "лекция",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Право социального обеспечения",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Право интеллектуальной собственности",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Право социального обеспечения",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык в сфере юриспруденции",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Корпоративное право ВостриковК.В",
            "kind": "лекция",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык в сфере юриспруденции",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-207",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Корпоративное право",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Административное право",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Административное право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-404",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Административное право",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "МН-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Статистика",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика организаций (предприятий)",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика организаций (предприятий)",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Налоги и налогообложение",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Налоги и налогообложение",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-201",
            "weeks": [
              5,
              6,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Документирование управленческой деятельности",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Документирование управленческой деятельности",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              5,
              6
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Теория менеджмента",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Теория менеджмента",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ]
      }
    },
    {
      "name": "ЭК-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "weeks": [
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Статистика",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика организаций (предприятий)",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Статистика",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика организаций (предприятий)",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы оптимальных решений",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы оптимальных решений",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы оптимальных решений",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г",
            "room": "М-411",
            "weeks": [
              5,
              6
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "лекция",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Безопасность жизнедеятельности",
            "kind": "практика",
            "teacher": "Махмутова К.Х.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/366531962618048?p=kxBOgTPsN3kslQwHXD",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленная электроника",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Промышленная электроника",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Общая энергетика и электроснабжение",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "АП-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Спецглавы теории управления",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Спецглавы теории управления",
            "kind": "практика",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Спецглавы теории управления",
            "kind": "практика",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника и электроника",
            "kind": "лекция",
            "teacher": "Кочетков М.В.",
            "room": "М-210",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "room": "М-210",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехника и электроника",
            "kind": "практика",
            "teacher": "Кочетков М.В.",
            "room": "М-210",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электротехника и электроника",
            "kind": "лабораторная",
            "teacher": "Кочетков М.В.",
            "room": "М-210",
            "weeks": [
              11,
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизация управления жизненным циклом продукции",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Антонченко В.П.",
            "weeks": [
              8,
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизация управления жизненным циклом продукции",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Маллабоев У.М.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "room": "М-301",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Янко Я.Ю.",
            "room": "М-301",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "лабораторная",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "МН-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление качеством",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              12,
              13,
              14
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Разработка и реализация бизнес-планов",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-209",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Разработка и реализация бизнес-планов",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-209",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление качеством",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экологический менеджмент",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление качеством",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экологический менеджмент",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-207",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организация производства",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организация производства",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-304",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Организация производства",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-304",
            "weeks": [
              5,
              6,
              7,
              11,
              12,
              13
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Корпоративная социальная ответственность",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-409",
            "weeks": [
              7,
              8,
              9,
              11,
              12,
              13
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Корпоративная социальная ответственность",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-409",
            "weeks": [
              14
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Корпоративная социальная ответственность",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-409",
            "weeks": [
              7,
              8,
              9,
              11,
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ЭК-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инновационный менеджмент",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-411",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инновационный менеджмент",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-411",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Биржевое дело",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Биржевое дело",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-206",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Биржевое дело",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Налогообложение физических и юридических лиц",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              8,
              9
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка инвестиций",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка инвестиций",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-210",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономическая оценка инвестиций",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические машины",
            "kind": "лабораторная",
            "teacher": "Саушкин С.А.",
            "room": "М-210",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "room": "М-210",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические машины",
            "kind": "лабораторная",
            "teacher": "Саушкин С.А.",
            "room": "М-210",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика энергетики",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "room": "М-207",
            "weeks": [
              7,
              8,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "note": "29.09.2026; пары нет",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика энергетики",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "room": "М-207",
            "weeks": [
              7,
              8,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-411",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Переходные процессы",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Техническая механика",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "М-401",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Техническая механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "М-401",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Переходные процессы",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Техническая механика",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "М-401",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретические основы электротехники",
            "kind": "лекция",
            "teacher": "Левченко И.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Теоретические основы электротехники",
            "kind": "лабораторная",
            "teacher": "Левченко И.В.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретические основы электротехники",
            "kind": "лабораторная",
            "teacher": "Левченко И.В.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теоретические основы электротехники",
            "kind": "практика",
            "teacher": "Левченко И.В.",
            "weeks": [
              8,
              10,
              12,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "АП-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технические измерения и приборы",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технические измерения и приборы",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория автоматического управления",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы микропроцессорной техники",
            "kind": "лекция",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы микропроцессорной техники",
            "kind": "практика",
            "teacher": "Мозгунов Д.В.",
            "weeks": [
              9,
              11,
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Механотроника",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Механотроника",
            "kind": "практика",
            "teacher": "Будников Д.А.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические машины",
            "kind": "лекция",
            "teacher": "Саушкин С.А.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические машины",
            "kind": "практика",
            "teacher": "Саушкин С.А.",
            "weeks": [
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "МН-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Планирование на предприятии",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-207",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Планирование на предприятии",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-207",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Планирование на предприятии",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-207",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Стратегический менеджмент",
            "kind": "лекция",
            "teacher": "Игнатова Т.В.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Стратегический менеджмент",
            "kind": "практика",
            "teacher": "Игнатова Т.В.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ и диагностика финансово-хозяйственной деятельности предприятия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "weeks": [
              6,
              7,
              8,
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Анализ и диагностика финансово-хозяйственной деятельности предприятия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-409",
            "weeks": [
              6,
              7,
              8,
              9,
              11,
              12
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-307",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-307",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-307",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Корпоративная социальная ответственность",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-408",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Корпоративная социальная ответственность",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-408",
            "weeks": [
              11
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Корпоративная социальная ответственность",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-408",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ЭК-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы внешнеэкономической деятельности",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "М-409",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы внешнеэкономической деятельности",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "М-409",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аудит",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-213",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аудит",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-213",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аудит",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-213",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы предпринимательского дела",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "weeks": [
              6,
              7,
              8,
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы предпринимательского дела",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы предпринимательского дела",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "weeks": [
              6,
              7,
              8,
              9,
              11,
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ прогнозирования рыночной коньюнктуры",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ прогнозирования рыночной коньюнктуры",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-103",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Анализ прогнозирования рыночной коньюнктуры",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Цифровые финансы и банки",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-211",
            "weeks": [
              6,
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Цифровые финансы и банки",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-211",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Цифровые финансы и банки",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-211",
            "weeks": [
              6,
              8,
              9,
              10,
              11,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "ЭЭ-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Релейная защита и автоматизация электроэнергетических систем",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              14,
              15
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электроэнергетические системы и сети",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электроэнергетические системы и сети",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              14,
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Электроснабжение",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              8,
              10,
              12,
              14,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Электроснабжение",
            "kind": "практика",
            "teacher": "Воробьев М.С.",
            "weeks": [
              8,
              10,
              12,
              14,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Электротехнологии",
            "kind": "лекция",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              11,
              13,
              15,
              17
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электротехнологии",
            "kind": "практика",
            "teacher": "Вайдич Я.Е.",
            "weeks": [
              9,
              11,
              13,
              15,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "МН-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ и диагностика финансово-хозяйственной деятельности",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Анализ и диагностика финансово-хозяйственной деятельности",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Стратегический менеджмент",
            "kind": "лекция",
            "teacher": "Игнатова Т.В.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Стратегический менеджмент",
            "kind": "практика",
            "teacher": "Игнатова Т.В.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ФК-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Комплексный анализ хозяйственной деятельности",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-206",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Комплексный анализ хозяйственной деятельности",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-206",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Функционально-стоимостной анализ",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-209",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Функционально-стоимостной анализ",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-209",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Антикризисное управление",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-401",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ЭП-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электрические и электронные аппараты",
            "kind": "лекция",
            "teacher": "Сикорский Д.А.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электрические и электронные аппараты",
            "kind": "практика",
            "teacher": "Сикорский Д.А.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Электробезопасность",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "weeks": [
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Электробезопасность",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "weeks": [
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование и конструирование электроустановок электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование и конструирование электроустановок электростанций и подстанций",
            "kind": "практика",
            "teacher": "Юркин В.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Оптимизация режимов энергопотребления",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "sat": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лекция",
            "teacher": "Воробьев М.С.",
            "weeks": [
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Электрическая часть электростанций и подстанций",
            "kind": "лабораторная",
            "teacher": "Воробьев М.С.",
            "weeks": [
              14,
              15,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "ГД-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в специальность",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в специальность",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в специальность",
            "kind": "практика",
            "teacher": "Поваринцын С.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геодезия",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Геодезия",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Политология",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Политология",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Политология",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              13,
              14,
              15
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Информатика",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-312",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информатика",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              6
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Добжанская О.Э.",
            "weeks": [
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Добжанская О.Э.",
            "weeks": [
              12,
              13,
              14,
              15,
              16,
              17
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "note": "16.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "note": "16.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Начертательная геометрия и инженерная графика",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "СА-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная геология и экология",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная геология и экология",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              6
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "СМ-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Добжанская О.Э.",
            "weeks": [
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Добжанская О.Э.",
            "weeks": [
              12,
              13,
              14,
              15,
              16,
              17
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              7
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы элементарной математики и элементарной физики",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-26оз",
      "course": 1,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы корпоративной культуры и деловое общение",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "История России",
            "kind": "лекция",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "История России",
            "kind": "практика",
            "teacher": "Добжанская О.Э",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Математический анализ",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "лекция",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая геометрия и линейная алгебра",
            "kind": "практика",
            "teacher": "Багомедова У.М.",
            "room": "П-315",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая культура и спорт",
            "kind": "практика",
            "teacher": "Бацунов С.Н.",
            "weeks": [
              15,
              16
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Неорганическая химия",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Неорганическая химия",
            "kind": "лабораторная",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика",
            "kind": "лекция",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Неорганическая химия",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Неорганическая химия",
            "kind": "лабораторная",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика",
            "kind": "практика",
            "teacher": "Эпштейн Д.Б.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "лекция",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              5
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы российской государственности",
            "kind": "практика",
            "teacher": "Самойлова Л.П.",
            "room": "М-222",
            "weeks": [
              6
            ]
          }
        ]
      }
    },
    {
      "name": "ГД-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы горного дела",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы горного дела",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геология",
            "kind": "лекция",
            "teacher": "Данилов О.С.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Геология",
            "kind": "лабораторная",
            "teacher": "Данилов О.С.",
            "room": "М-206",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Геология",
            "kind": "практика",
            "teacher": "Данилов О.С.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Геология",
            "kind": "лабораторная",
            "teacher": "Данилов О.С.",
            "room": "М-206",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Лозовский Э.Р.",
            "room": "М-205",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "room": "М-205",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "лабораторная",
            "teacher": "Лозовский Э.Р.",
            "room": "М-205",
            "weeks": [
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-109",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              9,
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерная графика",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерная графика",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерная графика",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теоретическая механика",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-101",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология конструкционных материалов",
            "kind": "лекция",
            "teacher": "Леонтьев В.В.",
            "room": "М-301",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология конструкционных материалов",
            "kind": "лабораторная",
            "teacher": "Леонтьев В.В.",
            "room": "М-301",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология конструкционных материалов",
            "kind": "практика",
            "teacher": "Леонтьев В.В.",
            "room": "М-301",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "СА-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "лекция",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория вероятностей и математическая статистика",
            "kind": "практика",
            "teacher": "Фидарова М.Г.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-308",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная геодезия",
            "kind": "лекция",
            "teacher": "Кокошка И.П.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы строительных конструкций и геотехники",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы строительных конструкций и геотехники",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная геодезия",
            "kind": "практика",
            "teacher": "Кокошка И.П.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы строительных конструкций и геотехники",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы архитектурно-строительного проектирования",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы архитектурно-строительного проектирования",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы архитектурно-строительного проектирования",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8,
              9
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная и компьютерная графика",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная и компьютерная графика",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-25оз",
      "course": 2,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерная графика",
            "kind": "лекция",
            "teacher": "Богданов С.В.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерная графика",
            "kind": "практика",
            "teacher": "Богданов С.В.",
            "room": "М-301",
            "weeks": [
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерная графика",
            "kind": "практика",
            "teacher": "Богданов С.В.",
            "room": "М-103",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальное взаимодействие",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "ЭИОС",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "ЭИОС",
            "weeks": [
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии и нейронные сети в металлургии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии и нейронные сети в металлургии",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правоведение",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              9,
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая химия Охтеменко И.Н. Общие химические технологии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "note": "15.10.2026",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Аналитическая химия Охтеменко И.Н. Общие химические технологии",
            "kind": "лабораторная",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "note": "15.10.2026",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Общие химические технологии Каверзин А.В. Аналитическая химия",
            "kind": "лекция",
            "teacher": "Охтеменко И.Н.",
            "note": "05.11.2026",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая химия Охтеменко И.Н. Общие химические технологии",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "note": "15.10.2026",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Аналитическая химия Охтеменко И.Н. Общие химические технологии",
            "kind": "лабораторная",
            "teacher": "Каверзин А.В.",
            "room": "М-109",
            "note": "15.10.2026",
            "weeks": [
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Общие химические технологии",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Введение в профиль",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Введение в профиль",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              15,
              16,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ГД-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "лекция",
            "teacher": "Антонченко В.П.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "room": "М-209",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная механика",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "room": "М-209",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "лекция",
            "teacher": "Корецкий А.С.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология и безопасность взрывных работ",
            "kind": "практика",
            "teacher": "Корецкий А.С.",
            "room": "М-206",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теплотехника",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "room": "М-405",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теплотехника",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "room": "М-405",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование рудников",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Горное право",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Горное право",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика горных пород",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физика горных пород",
            "kind": "лабораторная",
            "teacher": "Поварницын С.В.",
            "room": "М-305",
            "week": "both"
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Горное право",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика горных пород",
            "kind": "практика",
            "teacher": "Поваринцын С.В.",
            "room": "М-305",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физика горных пород",
            "kind": "лабораторная",
            "teacher": "Поваринцын С.В.",
            "room": "М-305",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ММ-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "лекция",
            "teacher": "Осипенко А.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Метрология, стандартизация и сертификация",
            "kind": "практика",
            "teacher": "Осипенко А.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин",
            "kind": "лекция",
            "teacher": "Антонченко В.П.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Детали машин",
            "kind": "лабораторная",
            "teacher": "Антонченко В.П.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Механика жидкости и газа",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Механика жидкости и газа",
            "kind": "лабораторная",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин",
            "kind": "практика",
            "teacher": "Антонченко В.П.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Детали машин",
            "kind": "лабораторная",
            "teacher": "Антонченко В.П.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Механика жидкости и газа",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы технологии машиностроения",
            "kind": "лекция",
            "teacher": "Чаава М.М.",
            "room": "https://teams.live.com/meet/9319072616248?p=SiIWaYQLGgLc1ItU8q",
            "note": "с 12.00",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы технологии машиностроения",
            "kind": "практика",
            "teacher": "Чаава М.М.",
            "room": "https://teams.live.com/meet/9319072616248?p=SiIWaYQLGgLc1ItU8q",
            "note": "с 12.00",
            "weeks": [
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы технологии машиностроения",
            "kind": "практика",
            "teacher": "Чаава М.М.",
            "room": "https://teams.live.com/meet/9319072616248?p=SiIWaYQLGgLc1ItU8q",
            "note": "с 13.30",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лекция",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "note": "с 15.00",
            "weeks": [
              5,
              7,
              9,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "note": "с 15.00",
            "weeks": [
              13
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "практика",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "note": "с 16.30",
            "weeks": [
              5,
              7,
              9,
              11
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Материаловедение",
            "kind": "лабораторная",
            "teacher": "Егоров М.С.",
            "room": "https://telemost.yandex.ru/j/20331620289930",
            "note": "с 16.30",
            "weeks": [
              13
            ]
          }
        ]
      }
    },
    {
      "name": "СА-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы проектирования зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              10
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы военной подготовки",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Средства механизации строительства",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "room": "М-101",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Средства механизации строительства",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "room": "М-101",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Охрана труда в строительстве",
            "kind": "лекция",
            "teacher": "Силин Д.С.",
            "room": "М-404",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Охрана труда в строительстве",
            "kind": "практика",
            "teacher": "Силин Д.С.",
            "room": "М-404",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Сопротивление материалов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-103",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Строительная механика",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Сопротивление материалов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "room": "М-103",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Строительная механика",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              9,
              10
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Технологические процессы в строительстве",
            "kind": "лекция",
            "teacher": "Малик П.А.",
            "room": "М-405",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технологические процессы в строительстве",
            "kind": "практика",
            "teacher": "Малик П.А.",
            "room": "М-405",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-24оз",
      "course": 3,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информатика",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургическое оборудование",
            "kind": "лекция",
            "teacher": "Вакуленко А.И.",
            "room": "М-211",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информатика",
            "kind": "лабораторная",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургическое оборудование",
            "kind": "практика",
            "teacher": "Вакуленко А.И.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория электрометаллургических процессов",
            "kind": "лекция",
            "teacher": "Малыгина Д.В.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория электрометаллургических процессов",
            "kind": "практика",
            "teacher": "Малыгина Д.В.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Инженерная графика",
            "kind": "лекция",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Инженерная графика",
            "kind": "практика",
            "teacher": "Лаговская Е.В.",
            "room": "М-103",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Производство никеля и кобальта",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Физическая химия",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-301",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Производство никеля и кобальта",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая химия",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-301",
            "weeks": [
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Физическая химия",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "room": "М-301",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Переработка техногенных ресурсов",
            "kind": "лекция",
            "teacher": "Николаева Ю.А.",
            "note": "16.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "16.10.2026; пары нет",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "16.10.2026; пары нет",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика металлургического предприятия",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "https://teams.microsoft.com/meet/3329996129356995?p=iwijaQrQsTGcyuXWtT",
            "weeks": [
              6,
              8,
              10,
              12
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономика металлургического предприятия",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "https://teams.microsoft.com/meet/3329996129356995?p=iwijaQrQsTGcyuXWtT",
            "weeks": [
              6,
              8,
              10,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "ММ-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические подъемно-транспортные машины",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "room": "М-213",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические подъемно-транспортные машины",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "room": "М-213",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические машины и оборудование",
            "kind": "лекция",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические машины и оборудование",
            "kind": "практика",
            "teacher": "Коробцова Е.В.",
            "weeks": [
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "лекция",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              9,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Динамика и прочность металлургических машин",
            "kind": "практика",
            "teacher": "Брусков А.Л.",
            "weeks": [
              8,
              9,
              11,
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Защита интеллектуальной собственности",
            "kind": "лекция",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Защита интеллектуальной собственности",
            "kind": "практика",
            "teacher": "Никоноров Л.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика и управление машиностроительным производством",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Триботехника",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Триботехника",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ]
      }
    },
    {
      "name": "СА-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Современные строительные системы",
            "kind": "лекция",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Современные строительные системы",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "room": "М-405",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "лекция",
            "teacher": "Бойко В.Г.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "практика",
            "teacher": "Бойко В.Г.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Железобетонные и каменные конструкции",
            "kind": "практика",
            "teacher": "Бойко В.Г.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "лекция",
            "teacher": "Бойко В.Г.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Конструкции из дерева и пластмасс",
            "kind": "практика",
            "teacher": "Бойко В.Г.",
            "weeks": [
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология возведения зданий и сооружений",
            "kind": "практика",
            "teacher": "Авилов Д.А.",
            "weeks": [
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ТМ-23оз",
      "course": 4,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургическая теплотехника",
            "kind": "лекция",
            "teacher": "Бородин А.Д.",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургическая теплотехника",
            "kind": "практика",
            "teacher": "Бородин А.Д.",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургическая теплотехника",
            "kind": "лабораторная",
            "teacher": "Бородин А.Д.",
            "weeks": [
              13,
              14,
              15
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Производство меди",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Производство меди",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              11,
              12,
              13,
              14
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургия благородных металлов",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургия благородных металлов",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория пирометаллургических процессов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория пирометаллургических процессов",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория пирометаллургических процессов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория пирометаллургических процессов",
            "kind": "лабораторная",
            "teacher": "Плотников С.С.",
            "weeks": [
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование месторождений полезных ископаемых",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерное моделирование месторождений полезных ископаемых",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Строительство и реконструкция горных предприятий",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Строительство и реконструкция горных предприятий",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Строительство и реконструкция горных предприятий",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "лекция",
            "teacher": "Маслов И.Ю.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Безопасность ведения горных работ и горноспасательное дело",
            "kind": "практика",
            "teacher": "Маслов И.Ю.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизация и информационные технологии",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизация и информационные технологии",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Горные машины и оборудование",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Горные машины и оборудование",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ]
      }
    },
    {
      "name": "МЦ-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экология металлургического производства",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экология металлургического производства",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-303",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экология металлургического производства",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургия легких металлов",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургия легких металлов",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургия легких металлов",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургия редких металлов",
            "kind": "лекция",
            "teacher": "Плотников С.С.",
            "room": "М-210",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургия редких металлов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-210",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургия редких металлов",
            "kind": "практика",
            "teacher": "Плотников С.С.",
            "room": "М-210",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленная вентиляция металлургических предприятий",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "room": "М-307",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленная вентиляция металлургических предприятий",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-307",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Промышленная вентиляция металлургических предприятий",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-307",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Переработка техногенных ресурсов",
            "kind": "лекция",
            "teacher": "Николаева Ю.А.",
            "note": "10.10.2026; пары нет",
            "weeks": [
              6,
              8,
              10
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "10.10.2026; пары нет",
            "weeks": [
              12
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Переработка техногенных ресурсов",
            "kind": "практика",
            "teacher": "Николаева Ю.А.",
            "note": "10.10.2026; пары нет",
            "weeks": [
              6,
              8,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "ПС-22оз",
      "course": 5,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование реконструкции зданий и сооружений",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "room": "М-406",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы технической эксплуатации зданий и сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-405",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование реконструкции зданий и сооружений",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "room": "М-406",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Охрана труда в строительстве",
            "kind": "лекция",
            "teacher": "Силин Д.Ю.",
            "room": "М-303",
            "weeks": [
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Охрана труда в строительстве",
            "kind": "практика",
            "teacher": "Силин Д.Ю.",
            "room": "М-303",
            "weeks": [
              6,
              7
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организация, планирование и управление строительством",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организация, планирование и управление строительством",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-303",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Организация, планирование и управление строительством",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-303",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ГИ-21оз",
      "course": 6,
      "level": "bachelor",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Комплексное освоение недр",
            "kind": "лекция",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Комплексное освоение недр",
            "kind": "практика",
            "teacher": "Лозовский Э.Р.",
            "room": "М-201",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология подземной и комбинированной разработки рудных месторождений",
            "kind": "лекция",
            "teacher": "Бибик С.Д.",
            "room": "М-205",
            "weeks": [
              7,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология подземной и комбинированной разработки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "room": "М-205",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология подземной и комбинированной разработки рудных месторождений",
            "kind": "практика",
            "teacher": "Бибик С.Д.",
            "room": "М-205",
            "weeks": [
              7,
              11,
              12,
              13,
              14,
              15
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование рудников",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование рудников",
            "kind": "практика",
            "teacher": "Поварницын С.В.",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "лекция",
            "teacher": "Поварницын С.В.",
            "room": "М-205",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Добыча и переработка полезных ископаемых",
            "kind": "практика",
            "teacher": "Повариницын С.В.",
            "room": "М-205",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12
            ]
          }
        ]
      }
    },
    {
      "name": "ИЭм-26з",
      "course": 1,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методология научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методология научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Программирование и конфигурирование корпоративных информационных систем",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Программирование и конфигурирование корпоративных информационных систем",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Программирование и конфигурирование корпоративных информационных систем",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              13,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование автоматизированных систем",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование автоматизированных систем",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              13,
              14,
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Анализ систем информационной безопасности",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          },
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Анализ систем информационной безопасности",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Информационная бизнес-аналитика",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "room": "М-222",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Информационная бизнес-аналитика",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-222",
            "weeks": [
              9,
              10
            ]
          },
          {
            "pair": 4,
            "time": "13:40–15:10",
            "subject": "Анализ систем информационной безопасности",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              11,
              12,
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 4,
            "time": "13:40–15:10",
            "subject": "Информационная бизнес-аналитика",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "room": "М-303",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "МНм-26з",
      "course": 1,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-103",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинговая деятельность предприятия",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-309",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Маркетинговая деятельность предприятия",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-309",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Маркетинговая деятельность предприятия",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-309",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Конкурентоспособность бизнеса",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Конкурентоспособность бизнеса",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Современные системы менеджмента",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Современные системы менеджмента",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Конкурентоспособность бизнеса",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Современные системы менеджмента ТоргашоваН.А",
            "kind": "практика",
            "weeks": [
              12,
              13,
              14
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Кадровый менеджмент",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Кадровый менеджмент",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Кадровый менеджмент",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ЭКм-26з",
      "course": 1,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление финансами организации и отраслей в условиях неопределенности и риска",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-309",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление финансами организации и отраслей в условиях неопределенности и риска",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-309",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление финансами организации и отраслей в условиях неопределенности и риска",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-309",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Микроэкономика (продвинутый уровень)",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "room": "М-407",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Микроэкономика (продвинутый уровень)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-407",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Микроэкономика (продвинутый уровень)",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "room": "М-407",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление развитием северных территорий",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-211",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление развитием северных территорий",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-211",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление развитием северных территорий",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-211",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление человеческими ресурсами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление человеческими ресурсами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление человеческими ресурсами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ИЭм-25з",
      "course": 2,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование сложных экономических систем",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование сложных экономических систем",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Построение бизнес-процессов интеллектуального предприятия",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерное моделирование сложных экономических систем",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Построение бизнес-процессов интеллектуального предприятия",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "weeks": [
              12,
              13
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ и моделирование бизнес-процессов",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ и моделирование бизнес-процессов",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Анализ и моделирование бизнес-процессов",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы информационного дизайна",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              8,
              9,
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы информационного дизайна",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              8,
              9,
              10
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Методы информационного дизайна",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              15,
              16
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Методы информационного дизайна",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              14,
              15,
              16
            ]
          }
        ]
      }
    },
    {
      "name": "МНм-25з",
      "course": 2,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Бизнес-планирование",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Бизнес-планирование",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Бизнес-планирование",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление IT-проектами в малом бизнесе",
            "kind": "лекция",
            "teacher": "Семенов Т.В.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление IT-проектами в малом бизнесе",
            "kind": "практика",
            "teacher": "Семенов Т.В.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление IT-проектами в малом бизнесе",
            "kind": "практика",
            "teacher": "Семенов Т.В.",
            "weeks": [
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы исследований в менеджменте",
            "kind": "лекция",
            "teacher": "Мужайлова Е.А.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы исследований в менеджменте",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "weeks": [
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы исследований в менеджменте",
            "kind": "практика",
            "teacher": "Мужайлова Е.А.",
            "weeks": [
              11,
              12,
              13,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "ЭКм-25з",
      "course": 2,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-222",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-109",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Современные концепции финансового учета и отчетности",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              13,
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Современные концепции финансового учета и отчетности",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              5,
              6
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правовое регулирование финансовой деятельности организаций",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-309",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правовое регулирование финансовой деятельности организаций",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-309",
            "weeks": [
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Финансовый и управленческий учет и отчетность",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Финансовый и управленческий учет и отчетность",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Финансовый и управленческий учет и отчетность",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              8,
              9
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Бизнес-планирование и технико-экономическое обоснование инвестиционных проектов",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-305",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Бизнес-планирование и технико-экономическое обоснование инвестиционных проектов",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-409",
            "weeks": [
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "ИЭм-24з",
      "course": 3,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Облачные и мобильные технологии",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Облачные и мобильные технологии",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          }
        ]
      }
    },
    {
      "name": "МНм-24з",
      "course": 3,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              1
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              2
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              1
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "weeks": [
              2
            ]
          }
        ]
      }
    },
    {
      "name": "ЭКм-24з",
      "course": 3,
      "level": "master",
      "form": "distance",
      "faculty": "feeiu",
      "days": {
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Оценка и управление стоимостью организации (предприятия)",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "У-203",
            "weeks": [
              3
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Оценка и управление стоимостью организации (предприятия)",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-203",
            "weeks": [
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Оценка и управление стоимостью организации (предприятия)",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-203",
            "weeks": [
              3
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "У-211",
            "weeks": [
              3
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "У-211",
            "weeks": [
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: 1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "У-211",
            "weeks": [
              4
            ]
          }
        ]
      }
    },
    {
      "name": "ММм-25з",
      "course": 2,
      "level": "master",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "лекция",
            "teacher": "Платов С.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/7889701384",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методология научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-307",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методология научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-307",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методология научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-211",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "room": "М-312",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлуригческих машин и агрегатов с электромеханическим приводом",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлуригческих машин и агрегатов с электромеханическим приводом",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Эксплуатация и ремонт металлуригческих машин и агрегатов с электромеханическим приводом",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              6,
              7,
              8,
              9,
              10
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "лекция",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              7,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "практика",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "практика",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              7,
              14,
              15
            ]
          }
        ]
      }
    },
    {
      "name": "ММм-24з",
      "course": 3,
      "level": "master",
      "form": "distance",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленный маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              3
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Промышленный маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Промышленный маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              4
            ]
          }
        ]
      }
    },
    {
      "name": "АПм-26",
      "course": 1,
      "level": "master",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "room": "М-211",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "room": "М-211",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Цифровые системы электроснабжения ч.1",
            "kind": "лабораторная",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровые системы электроснабжения ч.1",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "note": "с 14.20",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Основы научных исследований",
            "kind": "лабораторная",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "note": "с 16.00",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Моделирование систем электроснабжения в MATLAB",
            "kind": "лекция",
            "teacher": "Петров А.М.",
            "room": "М-209",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Математическое моделирование",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-213",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Моделирование систем электроснабжения в MATLAB",
            "kind": "лабораторная",
            "teacher": "Петров А.М.",
            "room": "М-209",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Математическое моделирование",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-213",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Моделирование автоматических систем управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Моделирование автоматических систем управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "АПм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (к итайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проектирование систем автоматизации и управления",
            "kind": "лабораторная",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Проектирование систем автоматизации и управления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы научно-исследовательской деятельности",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Цифровые системы электроснабжения, ч.3",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Цифровые системы электроснабжения, ч.3",
            "kind": "лабораторная",
            "teacher": "Жеребцов Б.В.",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Цифровые системы электроснабжения, ч.3",
            "kind": "лабораторная",
            "teacher": "Жеребцов Б.В.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Управление проектами",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы научно-исследовательской деятельности",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Управление проектами",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-312",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Приводы автоматизированного технологического оборудования",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Приводы автоматизированного технологического оборудования",
            "kind": "лабораторная",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Системы управления технологическими процессами в условиях Арктики",
            "kind": "лекция",
            "teacher": "Юркин В.В.",
            "note": "с 18.30",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Философия науки и техники",
            "kind": "лекция",
            "teacher": "Демченко О.Н.",
            "room": "М-207",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Системы управления технологическими процессами в условиях Арктики",
            "kind": "лабораторная",
            "teacher": "Юркин В.В.",
            "note": "с 20.00",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Философия науки и техники",
            "kind": "лабораторная",
            "teacher": "Демченко О.Н.",
            "room": "М-401",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Организационно-экономическое проектирование средств и систем управления",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "М-407",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Организационно-экономическое проектирование средств и систем управления",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "М-405",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "МНм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (к итайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Корпоративные финансы",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "note": "27.10.2026",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Корпоративные финансы",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методология стратегического анализа",
            "kind": "практика",
            "teacher": "Игнатова Т.В.",
            "room": "ЭИОС",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Методология стратегического анализа",
            "kind": "лекция",
            "teacher": "Игнатова Т.В.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Правовая среда современного бизнеса",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правовая среда современного бизнеса",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-303",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Налоговая политика как инструмент развития экономики",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "note": "23.10.2026",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Налоговая политика как инструмент развития экономики",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "note": "23.10.2026",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Бизнес-планирование",
            "kind": "лекция",
            "teacher": "Андреева Н.В.",
            "room": "М-304",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Бизнес-планирование",
            "kind": "практика",
            "teacher": "Андреева Н.В.",
            "room": "М-304",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ЭКм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Диагностика финансового состояния предприятий по отраслям",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "room": "М-303",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Диагностика финансового состояния предприятий по отраслям",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "room": "М-303",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (к итайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Бизнес планирование и технико-экономическое обоснование инвестиционных проектов",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Бизнес планирование и технико-экономическое обоснование инвестиционных проектов",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "room": "М-411",
            "week": "both"
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Финансовый и управленческий учет и отчетность",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "room": "М-210",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Финансовый и управленческий учет и отчетность",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "room": "М-210",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "1С Бухгалтерия",
            "kind": "лекция",
            "teacher": "Глубокова Л.Г.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "1С Бухгалтерия",
            "kind": "практика",
            "teacher": "Глубокова Л.Г.",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Оценка и управление стоимостью организации (предприятия)",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "М-109",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Оценка и управление стоимостью организации (предприятия)",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-305",
            "weeks": [
              5
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "перенос на",
            "room": "М-103",
            "weeks": [
              5
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "10., Оценка инновационной активности регионов Крайнего Севера",
            "kind": "практика, лекция",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-103",
            "note": "17.10.2026",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ММм-26",
      "course": 1,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-213",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методология научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-213",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Методология научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Педагогика высшей школы",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Педагогика высшей школы",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-308",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/394763746058646?p=YiCDLz4Dw2hUSZV4E0",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/39068956065441?p=E6iiwj8GdCpyL6DI5Y",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии при проектировании технологических машин и оборудования",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии при проектировании технологических машин и оборудования",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Современные проблемы в металловедении",
            "kind": "лекция",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Современные проблемы в металловедении",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Экономика и управление на предприятии",
            "kind": "лекция",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Экономика и управление на предприятии",
            "kind": "практика",
            "teacher": "Лобанова О.В.",
            "room": "ЭИОС",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "МЦм-26",
      "course": 1,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Информационные технологии в металлургии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Информационные технологии в металлургии",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-209",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-207",
            "week": "both"
          }
        ],
        "tue": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "room": "М-405",
            "note": "с 18.50",
            "week": "both"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "room": "М-405",
            "note": "с 20.30",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "note": "С 20.30",
            "weeks": [
              8,
              10,
              12,
              14,
              16,
              18
            ]
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проблемы экологии в металлургии",
            "kind": "практика",
            "teacher": "Кармановская Н.В.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проблемы экологии в металлургии",
            "kind": "лекция",
            "teacher": "Кармановская Н.В.",
            "room": "М-205",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "note": "с 18.50",
            "weeks": [
              9,
              11,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/39068956065441?p=E6iiwj8GdCpyL6DI5Y",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/33342746974099?p=Ve6kGwlIfOSok1OXp2",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы научных исследований",
            "kind": "практика",
            "teacher": "Востриков К.В.",
            "room": "М-207",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-401",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "САм-26",
      "course": 1,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Основы научных исследований",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-205",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Прикладная математика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-406",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Прикладная математика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-201",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Социальные коммуникации. Психология",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-211",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Социальные коммуникации. Психология",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-211",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Управление строительной организацией",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление строительной организацией",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-401",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-408",
            "week": "both"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "room": "М-303",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "room": "М-303",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "room": "М-303",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "room": "М-303",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "практика",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "практика",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лекция",
            "teacher": "Елесин М.А.; Череватова А.В.",
            "note": "08.10.2026; пары нет",
            "weeks": [
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17
            ]
          }
        ]
      }
    },
    {
      "name": "ММм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с электромеханическим приводом",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с электромеханическим приводом",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "week": "odd"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский )",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Промышленный маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "note": "с 18.30",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Промышленный маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "note": "с 20.00",
            "week": "odd"
          }
        ],
        "thu": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Техническое обслуживание грузоподъемного оборудования металлургических цехов",
            "kind": "лекция",
            "teacher": "Федоров А.А.",
            "room": "М-213",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "перенос на",
            "room": "М-409",
            "weeks": [
              10
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Техническое обслуживание грузоподъемного оборудования металлургических цехов",
            "kind": "практика",
            "teacher": "Федоров А.А.",
            "note": "19.11.2026",
            "week": "both"
          }
        ],
        "fri": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "лекция",
            "teacher": "Платов С.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/7889701384",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Гидропривод и современное гидравлическое оборудование металлургических машин и агрегатов",
            "kind": "лекция",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Гидропривод и современное гидравлическое оборудование металлургических машин и агрегатов",
            "kind": "практика",
            "teacher": "Курочкин А.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/1793229315",
            "week": "even"
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология монтажа и ремонта металлургического оборудования",
            "kind": "лекция",
            "teacher": "Осипенко А.А.",
            "room": "М-406",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Технология монтажа и ремонта металлургического оборудования",
            "kind": "практика",
            "teacher": "Осипенко А.А.",
            "room": "М-406",
            "week": "odd"
          }
        ]
      }
    },
    {
      "name": "МЦм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "с нед. № 7 Металлургические печи",
            "kind": "практика",
            "teacher": "Малахов П.В.",
            "note": "с 18.30",
            "week": "both"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "с нед. № 7 Металлургические печи",
            "kind": "лекция",
            "teacher": "Малахов П.В.",
            "note": "с 20.00",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский )",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          }
        ],
        "wed": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология командообразования",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология командообразования",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "week": "even"
          }
        ],
        "thu": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Расчеты металлургических процессов",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Расчеты металлургических процессов",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "М-101",
            "week": "both"
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "лекция",
            "teacher": "Петрунова-Лесникова Л.С.",
            "week": "even"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Подготовка сырья к обогащению",
            "kind": "лекция",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "М-201",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "практика",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "М-103",
            "week": "both"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Гидрометаллургические процессы",
            "kind": "лекция",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Подготовка сырья к обогащению",
            "kind": "практика",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "М-209",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Гидрометаллургические процессы",
            "kind": "практика",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "room": "М-109",
            "note": "17.10.2026; пары нет",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Гидрометаллургические процессы",
            "kind": "лабораторная",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "САм-25",
      "course": 2,
      "level": "master",
      "form": "fulltime",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "неч. - Технология производства строительных материалов и изделий на Крайнем Севере",
            "kind": "лекция",
            "teacher": "Череватова А.В.",
            "note": "С 18.30",
            "week": "odd"
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "неч. - Технология производства строительных материалов и изделий на Крайнем Севере",
            "kind": "практика",
            "teacher": "Череватова А.В.",
            "note": "С 20.00",
            "week": "even"
          }
        ],
        "tue": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Иностранный язык (китайский )",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Методы исследования и контроля качества строительных материалов",
            "kind": "лекция",
            "teacher": "Ильина Л.В.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Проблемы долговечности строительных материалов, изделий и конструкций",
            "kind": "лекция",
            "teacher": "Рысева О.П.",
            "week": "even"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Методы исследования и контроля качества строительных материалов",
            "kind": "практика",
            "teacher": "Ильина Л.В.",
            "room": "ЭИОС",
            "week": "odd"
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Проблемы долговечности строительных материалов, изделий и конструкций",
            "kind": "практика",
            "teacher": "Рысева О.П.",
            "week": "even"
          }
        ],
        "wed": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Лакокрасочные материалы",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "week": "odd"
          },
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Лакокрасочные материалы",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "week": "even"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "week": "odd"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Лакокрасочные материалы",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "week": "odd"
          }
        ],
        "sat": [
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Ресурсо- и энергосбережение в производстве строительных материалов",
            "kind": "лекция",
            "teacher": "Ильина Л.В.",
            "week": "even"
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Ресурсо- и энергосбережение в производстве строительных материалов",
            "kind": "практика",
            "teacher": "Ильина Л.В.",
            "week": "even"
          }
        ]
      }
    },
    {
      "name": "АПм-26оз",
      "course": 1,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Моделирование автоматических систем",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Моделирование автоматических систем",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Кострицына Н.А",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лекция",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Теория автоматического управления",
            "kind": "лабораторная",
            "teacher": "Будников Д.А.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              11
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы научных исследований",
            "kind": "лабораторная",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Цифровые системы электроснабжения, ч.1",
            "kind": "лекция",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Цифровые системы электроснабжения, ч.1",
            "kind": "лабораторная",
            "teacher": "Самарин Г.Н.",
            "room": "ЭИОС",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Математическое моделирование",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 3,
            "time": "12:00–13:30",
            "subject": "Математическое моделирование",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 4,
            "time": "13:40–15:10",
            "subject": "Математическое моделирование",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "УПм-26оз",
      "course": 1,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление мотивацией сотрудников",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление персоналом",
            "kind": "лекция",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление персоналом",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление мотивацией сотрудников",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление персоналом",
            "kind": "практика",
            "teacher": "Доменко Ю.Ю.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организационный дизайн",
            "kind": "лекция",
            "teacher": "Носкова Е.М.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Организационный дизайн",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика труда",
            "kind": "лекция",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика труда",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Организационный дизайн",
            "kind": "практика",
            "teacher": "Носкова Е.М.",
            "note": "13.10.2026; пары нет",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика труда",
            "kind": "практика",
            "teacher": "Торгашова Н.А.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Научная организация труда",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              9,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Научная организация труда",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Научная организация труда",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              9,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление мотивацией сотрудников",
            "kind": "лекция",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление мотивацией сотрудников",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление мотивацией сотрудников",
            "kind": "практика",
            "teacher": "Долженко Е.Н.",
            "weeks": [
              11
            ]
          }
        ]
      }
    },
    {
      "name": "АПм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование систем автоматизации и управления",
            "kind": "лекция",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование систем автоматизации и управления",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование систем автоматизации и управления",
            "kind": "практика",
            "teacher": "Жеребцов Б.В.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизированное проектирование средств и систем управления",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Автоматизированное проектирование средств и систем управления",
            "kind": "практика",
            "teacher": "Ершова И.Г.",
            "room": "ЭИОС",
            "weeks": [
              10,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Автоматизированное проектирование средств и систем управления",
            "kind": "лекция",
            "teacher": "Ершова И.Г.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          }
        ]
      }
    },
    {
      "name": "БПм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "лекция",
            "teacher": "Бурковская Н.В.",
            "room": "М-308",
            "note": "12.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "лекция",
            "teacher": "Бурковская Н.В.",
            "note": "07.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "лекция",
            "teacher": "Бурковская Н.В.",
            "room": "М-308",
            "note": "12.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "лекция",
            "teacher": "Бурковская Н.В.",
            "note": "07.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:50–17:10",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "практика",
            "teacher": "Бурковская Н.В.",
            "room": "М-308",
            "note": "12.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 5,
            "time": "15:50–17:10",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "практика",
            "teacher": "Бурковская Н.В.",
            "note": "07.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 6,
            "time": "17:20–18:50",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "практика",
            "teacher": "Бурковская Н.В.",
            "room": "М-308",
            "note": "12.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 6,
            "time": "17:20–18:50",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "практика",
            "teacher": "Бурковская Н.В.",
            "note": "07.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 7,
            "time": "19:00–20:30",
            "subject": "HR-функции и операционная работа с персоналом",
            "kind": "практика",
            "teacher": "Бурковская Н.В.",
            "note": "07.12.2026",
            "weeks": [
              15
            ]
          }
        ],
        "tue": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "лекция",
            "teacher": "Беляев И.С",
            "note": "08.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-308",
            "note": "13.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "практика",
            "teacher": "Беляев И.С",
            "note": "08.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-308",
            "note": "13.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "лекция",
            "teacher": "Беляев И.С",
            "room": "М-308",
            "note": "13.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "практика",
            "teacher": "Беляев И.С",
            "room": "М-308",
            "note": "13.10.2026",
            "weeks": [
              7
            ]
          }
        ],
        "wed": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "лекция",
            "teacher": "Беляев И.С",
            "note": "09.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-308",
            "note": "14.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "практика",
            "teacher": "Беляев И.С",
            "note": "09.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "room": "М-308",
            "note": "14.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 5,
            "time": "15:30–17:00",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "лекция",
            "teacher": "Беляев И.С",
            "room": "М-308",
            "note": "14.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 6,
            "time": "17:10–18:40",
            "subject": "Искусственный интеллект и аналитика данных",
            "kind": "практика",
            "teacher": "Беляев И.С",
            "room": "М-308",
            "note": "14.10.2026",
            "weeks": [
              7
            ]
          }
        ],
        "thu": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "note": "10.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "note": "10.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:50–17:10",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "note": "10.12.2026",
            "weeks": [
              15
            ]
          }
        ],
        "fri": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "лекция",
            "teacher": "Грибанова Ю.Б.",
            "note": "11.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Управление проектами в рамках стратегических инициатив",
            "kind": "практика",
            "teacher": "Грибанова Ю.Б.",
            "note": "11.12.2026",
            "weeks": [
              15
            ]
          }
        ],
        "sat": [
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "room": "М-308",
            "note": "17.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 3,
            "time": "12:10–13:40",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "note": "12.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "room": "М-308",
            "note": "17.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 4,
            "time": "13:50–15:20",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "note": "12.12.2026",
            "weeks": [
              15
            ]
          },
          {
            "pair": 5,
            "time": "15:50–17:10",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "room": "М-308",
            "note": "17.10.2026",
            "weeks": [
              7
            ]
          },
          {
            "pair": 5,
            "time": "15:50–17:10",
            "subject": "Ф-в: Китайская культура",
            "kind": "практика",
            "teacher": "Болтачева Е.А.",
            "note": "12.12.2026",
            "weeks": [
              15
            ]
          }
        ]
      }
    },
    {
      "name": "ИЭм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы информационного дизайна",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы информационного дизайна",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              12,
              13,
              14,
              15
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Построение бизнес-процессов интеллектуального предприятия",
            "kind": "лекция",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Построение бизнес-процессов интеллектуального предприятия",
            "kind": "практика",
            "teacher": "Попкова А.А.",
            "weeks": [
              9,
              10,
              11,
              12,
              13,
              14,
              15
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Анализ и моделирование бизнес процессов",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-304",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Анализ и моделирование бизнес процессов",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-304",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Компьютерное моделирование сложных экономических систем",
            "kind": "лекция",
            "teacher": "Фаддеенков А.В.",
            "room": "М-308",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Компьютерное моделирование сложных экономических систем",
            "kind": "практика",
            "teacher": "Фаддеенков А.В.",
            "room": "М-308",
            "weeks": [
              7,
              8,
              9,
              10,
              11,
              12,
              13
            ]
          }
        ]
      }
    },
    {
      "name": "ИЭм-24оз",
      "course": 3,
      "level": "master",
      "form": "mixed",
      "faculty": "feeiu",
      "days": {
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Облачные и мобильные технологии",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Облачные и мобильные технологии",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Облачные и мобильные технологии",
            "kind": "лекция",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Облачные и мобильные технологии",
            "kind": "практика",
            "teacher": "Пушкарев А.Н.",
            "room": "ЭИОС",
            "weeks": [
              3,
              4
            ]
          }
        ]
      }
    },
    {
      "name": "ММм-26оз",
      "course": 1,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Педагогика высшей школы",
            "kind": "лекция",
            "teacher": "Демченко И.В.",
            "room": "М-101",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Педагогика высшей школы",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-101",
            "weeks": [
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Педагогика высшей школы",
            "kind": "практика",
            "teacher": "Демченко И.В.",
            "room": "М-101",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии при проектировании технологических машин и оборудования",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              5,
              6,
              7
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии при проектировании технологических машин и оборудования",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии при проектировании технологических машин и оборудования",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              5,
              6,
              7
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3450009940897437?p=wQPATLFfmMthJ2kWjv",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика и управление на предприятии",
            "kind": "лекция",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономика и управление на предприятии",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/335826875449917?p=VsvUoYOnshGBgEvrLJ",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономика и управление на предприятии",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              9,
              10,
              11
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13,
              14
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Современные проблемы в металловедении",
            "kind": "лекция",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Современные проблемы в металловедении",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "weeks": [
              10
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Современные проблемы в металловедении",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "МЦм-26оз",
      "course": 1,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Информационные технологии в металлургии",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "room": "У-116",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Информационные технологии в металлургии",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "room": "У-116",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "лекция",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/3450009940897437?p=wQPATLFfmMthJ2kWjv",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "weeks": [
              13,
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Правовые аспекты инженерной деятельности",
            "kind": "практика",
            "teacher": "Балаева О.В.",
            "room": "https://teams.microsoft.com/meet/335826875449917?p=VsvUoYOnshGBgEvrLJ",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-406",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "лекция",
            "teacher": "Крупнов Л.В.",
            "note": "10.10.2026; пары нет",
            "weeks": [
              6,
              8,
              10,
              12,
              14
            ]
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Современные проблемы металлургии и материаловедения",
            "kind": "практика",
            "teacher": "Крупнов Л.В.",
            "note": "10.10.2026; пары нет",
            "weeks": [
              6,
              8,
              10,
              12,
              14
            ]
          }
        ]
      }
    },
    {
      "name": "САм-26оз",
      "course": 1,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Социальные коммуникации. Психология",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Социальные коммуникации. Психология",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "room": "У-108",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Проектирование технологий строительных материалов и изделий",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "room": "У-108",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Прикладная математика",
            "kind": "лекция",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Прикладная математика",
            "kind": "практика",
            "teacher": "Сотников А.И.",
            "room": "М-408",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология производства строительных материалов и изделий на Крайнем Севере",
            "kind": "лекция",
            "teacher": "Малик П.А.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология производства строительных материалов и изделий на Крайнем Севере",
            "kind": "практика",
            "teacher": "Малик П.А.",
            "room": "М-213",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология производства строительных материалов и изделий на Крайнем Севере",
            "kind": "практика",
            "teacher": "Малик П.А.",
            "room": "М-213",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Управление строительной организацией",
            "kind": "лекция",
            "teacher": "Губина Н.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Управление строительной организацией",
            "kind": "практика",
            "teacher": "Губина Н.А.",
            "room": "М-404",
            "weeks": [
              5,
              6,
              7,
              8
            ]
          }
        ],
        "sat": [
          {
            "pair": 1,
            "time": "08:40–10:10",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-404",
            "week": "both"
          },
          {
            "pair": 2,
            "time": "10:20–11:50",
            "subject": "Деловой иностранный язык",
            "kind": "практика",
            "teacher": "Смирнова А.Т.",
            "room": "М-403",
            "week": "both"
          }
        ]
      }
    },
    {
      "name": "ММм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "лекция",
            "teacher": "Платов С.И.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/7889701384",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Конструкция и расчет оборудования цехов обработки металлов давлением",
            "kind": "практика",
            "teacher": "Амиров Р.Н.",
            "room": "https://telemost.yandex.ru/j/79716055752425",
            "weeks": [
              6,
              7,
              8,
              9
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с электромеханическим приводом",
            "kind": "лекция",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9,
              10
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с электромеханическим приводом",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с электромеханическим приводом",
            "kind": "практика",
            "teacher": "Андреев Л.Н.",
            "room": "ЭИОС",
            "weeks": [
              7,
              8,
              9,
              10,
              11
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методология научных исследований",
            "kind": "лекция",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-312",
            "weeks": [
              6,
              7,
              8
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методология научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-312",
            "weeks": [
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методология научных исследований",
            "kind": "практика",
            "teacher": "Мурашова-Росс А.В.",
            "room": "М-312",
            "weeks": [
              6,
              7,
              8
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "лекция",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              7,
              14,
              15
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "практика",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Эксплуатация и ремонт металлургических машин и агрегатов с гидравлическим приводом",
            "kind": "практика",
            "teacher": "Фидаров Б.Ф.",
            "room": "М-309",
            "weeks": [
              7,
              14,
              15
            ]
          }
        ]
      }
    },
    {
      "name": "МЦм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Гидрометаллургические процессы",
            "kind": "лекция",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "room": "М-307",
            "weeks": [
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Гидрометаллургические процессы",
            "kind": "лабораторная",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "room": "М-307",
            "weeks": [
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Гидрометаллургические процессы",
            "kind": "практика",
            "teacher": "Брусничкина-Кириллова Л.Ю.",
            "room": "М-307",
            "weeks": [
              8,
              9,
              10,
              11
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы патентных исследований",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Основы патентных исследований",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Основы патентных исследований",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Территориальная организация предприятий цветной металлургии",
            "kind": "лекция",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Территориальная организация предприятий цветной металлургии",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Территориальная организация предприятий цветной металлургии",
            "kind": "практика",
            "teacher": "Черемисин А.А.",
            "weeks": [
              9,
              10,
              11,
              12,
              13
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Расчеты металлургических процессов",
            "kind": "лекция",
            "teacher": "Каверзин А.В.",
            "weeks": [
              9,
              10,
              11
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Расчеты металлургических процессов",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              12
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Технология командообразования",
            "kind": "лекция",
            "teacher": "Левочкина Н.А.",
            "room": "М-312",
            "weeks": [
              7,
              8
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Расчеты металлургических процессов",
            "kind": "практика",
            "teacher": "Каверзин А.В.",
            "weeks": [
              9,
              10,
              11,
              12
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Технология командообразования",
            "kind": "практика",
            "teacher": "Левочкина Н.А.",
            "room": "М-312",
            "weeks": [
              7,
              8
            ]
          }
        ]
      }
    },
    {
      "name": "САм-25оз",
      "course": 2,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "weeks": [
              14
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Научные методы исследования в строительном материаловедении",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "weeks": [
              10,
              11,
              12,
              13
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "лекция",
            "teacher": "Елесин М.А.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "room": "М-303",
            "weeks": [
              11,
              12,
              13
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Иностранный язык (китайский)",
            "kind": "практика",
            "teacher": "Вересова Е.А.",
            "weeks": [
              14,
              15,
              16
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "практика",
            "teacher": "Елесин М.А.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9,
              11
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Технология бетонов на местной сырьевой базе",
            "kind": "лабораторная",
            "teacher": "Елесин М.А.",
            "room": "М-303",
            "weeks": [
              12
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Методы исследования и контроля качества строительных материалов",
            "kind": "лекция",
            "teacher": "Ильина Л.В.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Методы исследования и контроля качества строительных материалов",
            "kind": "практика",
            "teacher": "Ильина Л.В.",
            "room": "М-303",
            "weeks": [
              7,
              8,
              9
            ]
          }
        ]
      }
    },
    {
      "name": "ММм-24оз",
      "course": 3,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "лекция",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Ф-в: Промышленный маркетинг",
            "kind": "лекция",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Ф-в: Промышленный маркетинг",
            "kind": "практика",
            "teacher": "Разгон А.В.",
            "room": "https://teams.live.com/meet/9392944529289?p=XrpRygJdwo9Wk8ncCX",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "лекция",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "thu": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Экономическая оценка технических и технологических решений при модернизации и ремонте металлургического оборудования",
            "kind": "практика",
            "teacher": "Сологуб Д.В.",
            "room": "У-202",
            "weeks": [
              3
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              3
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Триботехника металлургических машин и агрегатов",
            "kind": "практика",
            "teacher": "Ярославцев А.В.",
            "room": "http://b44436.vr.mirapolis.ru/mira/miravr/2373084305",
            "weeks": [
              3
            ]
          }
        ]
      }
    },
    {
      "name": "МЦм-24оз",
      "course": 3,
      "level": "master",
      "form": "mixed",
      "faculty": "gtf",
      "days": {
        "mon": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические печи",
            "kind": "лекция",
            "teacher": "Малахов П.В",
            "note": "05.10.2026; пары нет",
            "weeks": [
              3,
              4,
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические печи",
            "kind": "практика",
            "teacher": "Малахов П.В",
            "note": "05.10.2026; пары нет",
            "weeks": [
              3,
              4,
              5,
              6
            ]
          }
        ],
        "tue": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Металлургические печи",
            "kind": "практика",
            "teacher": "Малахов П.В",
            "note": "22.09.2026; пары нет",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Металлургические печи",
            "kind": "практика",
            "teacher": "Малахов П.В",
            "note": "22.09.2026; пары нет",
            "weeks": [
              3,
              4
            ]
          }
        ],
        "wed": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "лекция",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "М-211",
            "weeks": [
              3,
              4,
              5,
              6
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "практика",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "М-211",
            "weeks": [
              3,
              4,
              5,
              6
            ]
          }
        ],
        "fri": [
          {
            "pair": 7,
            "time": "18:50–20:20",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "практика",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "У-108",
            "weeks": [
              3,
              4
            ]
          },
          {
            "pair": 8,
            "time": "20:30–22:00",
            "subject": "Комплексная переработка минерального сырья",
            "kind": "практика",
            "teacher": "Петрунова-Лесникова Л.С.",
            "room": "У-108",
            "weeks": [
              3
            ]
          }
        ]
      }
    }
  ]
};
